[
    {
        "id": "http://arxiv.org/abs/2511.02531v2",
        "title": "Causal Graph Neural Networks for Healthcare",
        "summary": "Healthcare artificial intelligence systems routinely fail when deployed across institutions, with documented performance drops and perpetuation of discriminatory patterns embedded in historical data. This brittleness stems, in part, from learning statistical associations rather than causal mechanisms. Causal graph neural networks address this triple crisis of distribution shift, discrimination, and inscrutability by combining graph-based representations of biomedical data with causal inference principles to learn invariant mechanisms rather than spurious correlations. This Review examines methodological foundations spanning structural causal models, disentangled causal representation learning, and techniques for interventional prediction and counterfactual reasoning on graphs. We analyse applications demonstrating clinical value across psychiatric diagnosis through brain network analysis, cancer subtyping via multi-omics causal integration, continuous physiological monitoring with mechanistic interpretation, and drug recommendation correcting prescription bias. These advances establish foundations for patient-specific Causal Digital Twins, enabling in silico clinical experimentation, with integration of large language models for hypothesis generation and causal graph neural networks for mechanistic validation. Substantial barriers remain, including computational requirements precluding real-time deployment, validation challenges demanding multi-modal evidence triangulation beyond cross-validation, and risks of causal-washing where methods employ causal terminology without rigorous evidentiary support. We propose tiered frameworks distinguishing causally-inspired architectures from causally-validated discoveries and identify critical research priorities making causal rather than purely associational claims.",
        "authors": "Munib Mesinovic, Max Buhlan, Tingting Zhu",
        "url": "http://arxiv.org/abs/2511.02531v2",
        "pdf_url": "http://arxiv.org/pdf/2511.02531v2",
        "reason_zh": "这篇综述完美契合了您作为数理统计博士生，专注于将严谨数学逻辑应用于现代 AI 系统以提升鲁棒性和效果的兴趣。它直接关注“因果推断”，这是您的核心兴趣点之一，并深入探讨了如何通过因果图神经网络解决 AI 系统在“分布偏移”和“歧视性模式”方面的鲁棒性问题，这与“模型泛化界限的数学基础”紧密相关。文章还讨论了“表示学习”中从统计关联转向因果机制的理论瓶颈。尽管应用场景是医疗保健，但因果推断的原理是普适的，对于您的量化金融项目（加密货币因子构造）具有直接指导作用，因为在金融领域区分因果关系和虚假相关性是构建稳健因子的关键。此外，文中提到整合大型语言模型进行假设生成，也符合您对 LLM 前沿应用的兴趣。它强调了严谨的“因果验证”和“机制解释”，而非“因果洗白”，这与您追求“逻辑性强、可落地的知识”的偏好高度一致。",
        "reason_en": "This review perfectly aligns with your interests as a PhD student in mathematical statistics, focusing on applying rigorous mathematical logic to modern AI systems for robustness and effectiveness. It directly addresses 'Causal inference,' a core interest, and delves into how Causal Graph Neural Networks can tackle robustness issues like 'distribution shift' and 'discriminatory patterns' in AI systems, closely relating to the 'mathematical foundations of model generalization bounds.' The paper also discusses theoretical bottlenecks in 'representation learning' by shifting from statistical associations to causal mechanisms. Although the application domain is healthcare, the principles of causal inference are universal and offer direct guidance for your quantitative finance projects (cryptocurrency factor construction), as distinguishing causal relationships from spurious correlations is crucial for building robust factors in finance. Furthermore, the mention of integrating Large Language Models for hypothesis generation aligns with your interest in frontier LLM applications. It emphasizes rigorous 'causal validation' and 'mechanistic interpretation' over 'causal-washing,' which is highly consistent with your pursuit of 'logic-strong, actionable knowledge.'"
    },
    {
        "id": "http://arxiv.org/abs/2511.01680v1",
        "title": "Making Interpretable Discoveries from Unstructured Data: A High-Dimensional Multiple Hypothesis Testing Approach",
        "summary": "Social scientists are increasingly turning to unstructured datasets to unlock new empirical insights, e.g., estimating causal effects on text outcomes, measuring beliefs from open-ended survey responses. In such settings, unsupervised analysis is often of interest, in that the researcher does not want to pre-specify the objects of measurement or otherwise artificially delimit the space of measurable concepts; they are interested in discovery. This paper proposes a general and flexible framework for pursuing discovery from unstructured data in a statistically principled way. The framework leverages recent methods from the literature on machine learning interpretability to map unstructured data points to high-dimensional, sparse, and interpretable dictionaries of concepts; computes (test) statistics of these dictionary entries; and then performs selective inference on them using newly developed statistical procedures for high-dimensional exceedance control of the $k$-FWER under arbitrary dependence. The proposed framework has few researcher degrees of freedom, is fully replicable, and is cheap to implement -- both in terms of financial cost and researcher time. Applications to recent descriptive and causal analyses of unstructured data in empirical economics are explored. An open source Jupyter notebook is provided for researchers to implement the framework in their own projects.",
        "authors": "Jacob Carlson",
        "url": "http://arxiv.org/abs/2511.01680v1",
        "pdf_url": "http://arxiv.org/pdf/2511.01680v1",
        "reason_zh": "这篇论文与您对“高维统计”和“统计基础与保证”的兴趣完美契合。它提出了一种统计学上严谨的框架，通过“高维多重假设检验”和“选择性推断”，从非结构化数据中进行可解释的发现，这正是您在提升 AI 系统鲁棒性和效果时所寻求的。其方法论利用了“机器学习可解释性”技术，将非结构化数据映射到可解释的概念字典，并提供了在任意依赖结构下控制 k-FWER 的统计保证。此方法对于您的“量化金融项目（加密货币因子构造）”具有极高的直接指导作用：从新闻、社交媒体等非结构化数据中稳健地提取可解释的因子，是构建另类数据驱动策略的关键。文中强调“较少的研究者自由度、完全可复现且实施成本低”，这充分满足了您对“逻辑性强、可落地的知识”的追求，避免了过于抽象或缺乏实际验证的理论。",
        "reason_en": "This paper perfectly aligns with your interest in 'high-dimensional statistics' and 'statistical foundations and guarantees.' It proposes a statistically principled framework for making interpretable discoveries from unstructured data using 'high-dimensional multiple hypothesis testing' and 'selective inference,' which is precisely what you seek for enhancing AI system robustness and effectiveness. Its methodology leverages 'machine learning interpretability' techniques to map unstructured data to interpretable dictionaries of concepts and provides statistical guarantees for controlling k-FWER under arbitrary dependence. This approach is highly directly applicable to your 'quantitative finance projects (cryptocurrency factor construction),' as robustly extracting interpretable factors from unstructured data (e.g., news, social media) is crucial for building alternative data-driven strategies. The emphasis on 'few researcher degrees of freedom, fully replicable, and cheap to implement' fully satisfies your preference for 'logic-strong, actionable knowledge,' avoiding overly abstract or practically unverified theories."
    }
]