[
    {
        "id": "http://arxiv.org/abs/2511.01196v1",
        "title": "An Interdisciplinary and Cross-Task Review on Missing Data Imputation",
        "summary": "Missing data is a fundamental challenge in data science, significantly hindering analysis and decision-making across a wide range of disciplines, including healthcare, bioinformatics, social science, e-commerce, and industrial monitoring. Despite decades of research and numerous imputation methods, the literature remains fragmented across fields, creating a critical need for a comprehensive synthesis that connects statistical foundations with modern machine learning advances. This work systematically reviews core concepts-including missingness mechanisms, single versus multiple imputation, and different imputation goals-and examines problem characteristics across various domains. It provides a thorough categorization of imputation methods, spanning classical techniques (e.g., regression, the EM algorithm) to modern approaches like low-rank and high-rank matrix completion, deep learning models (autoencoders, GANs, diffusion models, graph neural networks), and large language models. Special attention is given to methods for complex data types, such as tensors, time series, streaming data, graph-structured data, categorical data, and multimodal data. Beyond methodology, we investigate the crucial integration of imputation with downstream tasks like classification, clustering, and anomaly detection, examining both sequential pipelines and joint optimization frameworks. The review also assesses theoretical guarantees, benchmarking resources, and evaluation metrics. Finally, we identify critical challenges and future directions, emphasizing model selection and hyperparameter optimization, the growing importance of privacy-preserving imputation via federated learning, and the pursuit of generalizable models that can adapt across domains and data types, thereby outlining a roadmap for future research.",
        "authors": "Jicong Fan",
        "url": "http://arxiv.org/abs/2511.01196v1",
        "pdf_url": "http://arxiv.org/pdf/2511.01196v1",
        "reason_zh": "这篇论文是对缺失数据插补的跨学科、跨任务的综合性综述。缺失数据是统计学和数据科学中的一个根本性挑战，与用户的“扎实的数学基础”偏好高度吻合。该综述涵盖了从经典统计方法（如回归、EM算法）到前沿深度学习模型（如GANs、扩散模型、图神经网络、LLMs）的广泛技术，完美体现了用户对“可落地的前沿技术”的追求。它还讨论了理论保证、评估指标以及与下游任务（分类、聚类）的整合，兼顾了理论深度和实际应用，避免了纯理论的抽象，非常适合统计学硕士阅读。",
        "reason_en": "This paper offers a comprehensive, interdisciplinary, and cross-task review of missing data imputation. Missing data is a fundamental challenge in statistics and data science, aligning perfectly with the user's preference for 'solid mathematical foundations'. The review covers a wide array of techniques, from classical statistical methods (e.g., regression, EM algorithm) to cutting-edge deep learning models (e.g., GANs, diffusion models, Graph Neural Networks, LLMs), which perfectly matches the user's interest in 'applicable cutting-edge technologies'. It also discusses theoretical guarantees, evaluation metrics, and integration with downstream tasks (classification, clustering), striking a balance between theoretical depth and practical application, thus avoiding overly abstract pure theory. This makes it an ideal read for a Master of Statistics student."
    },
    {
        "id": "http://arxiv.org/abs/2511.03448v1",
        "title": "A Review of Bilevel Optimization: Methods, Emerging Applications, and Recent Advancements",
        "summary": "This paper presents a comprehensive review of techniques proposed in the literature for solving bilevel optimization problems encountered in various real-life applications. Bilevel optimization is an appropriate choice for hierarchical decision-making situations, where a decision-maker needs to consider a possible response from stakeholder(s) for each of its actions to achieve his own goals. Mathematically, it leads to a nested optimization structure, in which a primary (leader's) optimization problem contains a secondary (follower's) optimization problem as a constraint. Various forms of bilevel problems, including linear, mixed-integer, single-objective, and multi-objective, are covered. For bilevel problem solving methods, various classical and evolutionary approaches are explained. Along with an overview of various areas of applications, two recent considerations of bilevel approach are introduced. The first application involves a bilevel decomposition approach for solving general optimization problems, and the second application involves Neural Architecture Search (NAS), which is a prime example of a bilevel optimization problem in the area of machine learning.",
        "authors": "Dhaval Pujara, Ankur Sinha",
        "url": "http://arxiv.org/abs/2511.03448v1",
        "pdf_url": "http://arxiv.org/pdf/2511.03448v1",
        "reason_zh": "这篇论文是对双层优化（Bilevel Optimization）方法、新兴应用和最新进展的全面综述。双层优化是用户明确喜欢的“优化方法”领域中的一个复杂而强大的分支。它深入探讨了双层问题的各种形式（线性、混合整数、单目标、多目标）以及经典和进化算法等多种求解方法，并介绍了机器学习领域中新兴应用（如神经架构搜索NAS）。作为一篇综述，它有望做到“深入浅出”，且其内容聚焦于可落地的优化技术，完全符合用户对“可落地的前沿技术”的偏好，同时避免了“过于抽象、无法应用的‘空中楼阁’”式纯理论。",
        "reason_en": "This paper presents a comprehensive review of Bilevel Optimization techniques, emerging applications, and recent advancements. Bilevel optimization is a sophisticated and powerful branch within the 'optimization methods' area that the user explicitly likes. It delves into various forms of bilevel problems (linear, mixed-integer, single-objective, multi-objective) and a range of solution approaches, including classical and evolutionary algorithms. It also highlights emerging applications in machine learning, such as Neural Architecture Search (NAS). As a review, it is expected to be 'in-depth yet easy to understand', and its focus on applicable optimization techniques perfectly aligns with the user's preference for 'applicable cutting-edge technologies', while avoiding 'overly abstract, impractical pure theory'."
    }
]