[
    {
        "id": "http://arxiv.org/abs/2511.06585v1",
        "title": "Learning Biomolecular Motion: The Physics-Informed Machine Learning Paradigm",
        "summary": "The convergence of statistical learning and molecular physics is transforming our approach to modeling biomolecular systems. Physics-informed machine learning (PIML) offers a systematic framework that integrates data-driven inference with physical constraints, resulting in models that are accurate, mechanistic, generalizable, and able to extrapolate beyond observed domains. This review surveys recent advances in physics-informed neural networks and operator learning, differentiable molecular simulation, and hybrid physics-ML potentials, with emphasis on long-timescale kinetics, rare events, and free-energy estimation. We frame these approaches as solutions to the \"biomolecular closure problem\", recovering unresolved interactions beyond classical force fields while preserving thermodynamic consistency and mechanistic interpretability. We examine theoretical foundations, tools and frameworks, computational trade-offs, and unresolved issues, including model expressiveness and stability. We outline prospective research avenues at the intersection of machine learning, statistical physics, and computational chemistry, contending that future advancements will depend on mechanistic inductive biases, and integrated differentiable physical learning frameworks for biomolecular simulation and discovery.",
        "authors": "Aaryesh Deshpande",
        "url": "http://arxiv.org/abs/2511.06585v1",
        "pdf_url": null,
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇综述完美契合了您将严谨数学逻辑应用于现代AI系统以提升其鲁棒性和效果的兴趣。它专注于“物理信息机器学习”（PIML）范式，该范式通过整合数据驱动的推理与物理约束，构建出精确、具机制性、可泛化且能外推的模型，这与您对模型泛化界限的数学基础以及提升AI系统鲁棒性的追求高度一致。文章明确指出将探讨“理论基础”，涵盖了物理信息神经网络、算子学习、可微分分子模拟等“现代方法论”，并强调了其在解决长时尺度动力学、稀有事件和自由能估计等理论瓶颈方面的潜力。文笔和结构上，作为一篇综述，它承诺系统性地审视理论基础、工具框架和未解决的问题，预示着清晰的逻辑脉络和深入浅出的解释。"
    },
    {
        "id": "http://arxiv.org/abs/2511.04770v1",
        "title": "Machine Learning-Driven Analysis of kSZ Maps to Predict CMB Optical Depth $τ$",
        "summary": "Upcoming measurements of the kinetic Sunyaev-Zel'dovich (kSZ) effect, which results from Cosmic Microwave Background (CMB) photons scattering off moving electrons, offer a powerful probe of the Epoch of Reionization (EoR). The kSZ signal contains key information about the timing, duration, and spatial structure of the EoR. A precise measurement of the CMB optical depth $τ$, a key parameter that characterizes the universe's integrated electron density, would significantly constrain models of early structure formation. However, the weak kSZ signal is difficult to extract from CMB observations due to significant contamination from astrophysical foregrounds. We present a machine learning approach to extract $τ$ from simulated kSZ maps. We train advanced machine learning models, including swin transformers, on high-resolution seminumeric simulations of the kSZ signal. To robustly quantify prediction uncertainties of $τ$, we employ the Laplace Approximation (LA). This approach provides an efficient and principled Gaussian approximation to the posterior distribution over the model's weights, allowing for reliable error estimation. We investigate and compare two distinct application modes: a post-hoc LA applied to a pre-trained model, and an online LA where model weights and hyperparameters are optimized jointly by maximizing the marginal likelihood. This approach provides a framework for robustly constraining $τ$ and its associated uncertainty, which can enhance the analysis of upcoming CMB surveys like the Simons Observatory and CMB-S4.",
        "authors": "Farshid Farhadi Khouzani, Abinash Kumar Shaw, Paul La Plante, Bryar Mustafa Shareef, Laxmi Gewali",
        "url": "http://arxiv.org/abs/2511.04770v1",
        "pdf_url": null,
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文在您的偏好中得分极高，尤其是在“统计基础与保证”和“理论严谨性”方面。它采用机器学习方法（包括Swin Transformer这一“现代方法论”）分析高维kSZ图，以预测宇宙微波背景光学深度τ，并特别强调了使用“Laplace Approximation (LA)”来“稳健地量化预测不确定性”，提供“对模型权重后验分布的高效且有原则的高斯近似，从而实现可靠的误差估计”。这直接回应了您对“高维统计”、“模型泛化界限的数学基础”以及提升AI系统“鲁棒性”的严谨数学逻辑应用的需求。其方法论清晰，应用场景具体，避免了过于抽象或缺乏落地验证的理论，完美符合您对逻辑性强、可落地知识的追求。"
    }
]