[
    {
        "id": "http://arxiv.org/abs/2511.16333v1",
        "title": "Beyond Generative AI: World Models for Clinical Prediction, Counterfactuals, and Planning",
        "summary": "Healthcare requires AI that is predictive, reliable, and data-efficient. However, recent generative models lack physical foundation and temporal reasoning required for clinical decision support. As scaling language models show diminishing returns for grounded clinical reasoning, world models are gaining traction because they learn multimodal, temporally coherent, and action-conditioned representations that reflect the physical and causal structure of care. This paper reviews World Models for healthcare systems that learn predictive dynamics to enable multistep rollouts, counterfactual evaluation and planning. We survey recent work across three domains: (i) medical imaging and diagnostics (e.g., longitudinal tumor simulation, projection-transition modeling, and Joint Embedding Predictive Architecture i.e., JEPA-style predictive representation learning), (ii) disease progression modeling from electronic health records (generative event forecasting at scale), and (iii) robotic surgery and surgical planning (action-conditioned guidance and control). We also introduce a capability rubric: L1 temporal prediction, L2 action-conditioned prediction, L3 counterfactual rollouts for decision support, and L4 planning/control. Most reviewed systems achieve L1--L2, with fewer instances of L3 and rare L4. We identify cross-cutting gaps that limit clinical reliability; under-specified action spaces and safety constraints, weak interventional validation, incomplete multimodal state construction, and limited trajectory-level uncertainty calibration. This review outlines a research agenda for clinically robust prediction-first world models that integrate generative backbones (transformers, diffusion, VAE) with causal/mechanical foundation for safe decision support in healthcare.",
        "authors": "Mohammad Areeb Qazi, Maryam Nadeem, Mohammad Yaqub",
        "url": "http://arxiv.org/abs/2511.16333v1",
        "pdf_url": "https://arxiv.org/pdf/2511.16333v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 5,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "综述了世界模型在医疗领域结合生成式AI、因果推断（反事实）和规划（类强化学习）的最新进展，为未来研究指明方向。",
        "reason_zh": "这篇综述完美契合您对生成式AI、因果推断（通过'反事实'分析）和强化学习（通过'规划'）的兴趣。它提出了一个能力评估框架和研究议程，具有极高的前瞻性和理论深度，能有效指引未来的研究方向。"
    },
    {
        "id": "http://arxiv.org/abs/2511.18530v1",
        "title": "Transforming Conditional Density Estimation Into a Single Nonparametric Regression Task",
        "summary": "We propose a way of transforming the problem of conditional density estimation into a single nonparametric regression task via the introduction of auxiliary samples. This allows leveraging regression methods that work well in high dimensions, such as neural networks and decision trees. Our main theoretical result characterizes and establishes the convergence of our estimator to the true conditional density in the data limit. We develop condensité, a method that implements this approach. We demonstrate the benefit of the auxiliary samples on synthetic data and showcase that condensité can achieve good out-of-the-box results. We evaluate our method on a large population survey dataset and on a satellite imaging dataset. In both cases, we find that condensité matches or outperforms the state of the art and yields conditional densities in line with established findings in the literature on each dataset. Our contribution opens up new possibilities for regression-based conditional density estimation and the empirical results indicate strong promise for applied research.",
        "authors": "Alexander G. Reisach, Olivier Collier, Alex Luedtke, Antoine Chambaz",
        "url": "http://arxiv.org/abs/2511.18530v1",
        "pdf_url": "https://arxiv.org/pdf/2511.18530v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "提出了一种将条件密度估计转化为单非参数回归任务的新方法，并提供了严格的理论收敛性证明，对高维统计方法有重要贡献。",
        "reason_zh": "这篇论文直接切入高维统计和非参数方法的核心，提出了一种新颖且具有数学严谨性的方法，并提供了理论收敛性证明。对于您作为数理统计博士生，这是拓展高维统计研究思路的优秀资料。"
    },
    {
        "id": "http://arxiv.org/abs/2511.18633v1",
        "title": "Bridging Philosophy and Machine Learning: A Structuralist Framework for Classifying Neural Network Representations",
        "summary": "Machine learning models increasingly function as representational systems, yet the philosoph- ical assumptions underlying their internal structures remain largely unexamined. This paper develops a structuralist decision framework for classifying the implicit ontological commitments made in machine learning research on neural network representations. Using a modified PRISMA protocol, a systematic review of the last two decades of literature on representation learning and interpretability is conducted. Five influential papers are analysed through three hierarchical criteria derived from structuralist philosophy of science: entity elimination, source of structure, and mode of existence. The results reveal a pronounced tendency toward structural idealism, where learned representations are treated as model-dependent constructions shaped by architec- ture, data priors, and training dynamics. Eliminative and non-eliminative structuralist stances appear selectively, while structural realism is notably absent. The proposed framework clarifies conceptual tensions in debates on interpretability, emergence, and epistemic trust in machine learning, and offers a rigorous foundation for future interdisciplinary work between philosophy of science and machine learning.",
        "authors": "Yildiz Culcu",
        "url": "http://arxiv.org/abs/2511.18633v1",
        "pdf_url": "https://arxiv.org/pdf/2511.18633v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "从结构主义哲学视角审视机器学习中神经网络表示的本体论承诺，为理解LLM理论机制和可解释性提供了深刻的理论框架。",
        "reason_zh": "这篇论文从哲学和理论层面探讨了神经网络（包括LLM）的内部表示机制，这对于深入理解LLM的理论基础和可解释性至关重要。它提供了一个高层次的分析框架，有助于您从更深层次思考AI模型的基础。"
    },
    {
        "id": "http://arxiv.org/abs/2511.20610v1",
        "title": "Building a Foundation Model for Trajectory from Scratch",
        "summary": "Foundation models are transformative in artificial intelligence, but building them from scratch, especially for mobility trajectories, is not yet clear or documented. This tutorial bridges this gap by demonstrating the steps and code of a minimal implementation of a trajectory-focused foundation model starting from GPT-2. Through a concise, step-by-step, code-driven process, we demonstrate adapting GPT-2 for spatiotemporal data. We then review and compare representative trajectory foundation models, such as TrajFM and TrajGPT, highlighting their architectural innovations and differences. Additionally, we introduce complementary techniques from related domains, like TimesFM's patching approach. Targeted at researchers and practitioners, this tutorial aims to explain the concepts and terminology of foundation models, at the implementation level. We find it timely and indispensable to create this educational material in order to support the SIGSPATIAL community in building and evaluating mobility foundation models, enhancing both research clarity and peer-review effectiveness in mobility AI.",
        "authors": "Gaspard Merten, Mahmoud Sakr, Gilles Dejaegere",
        "url": "http://arxiv.org/abs/2511.20610v1",
        "pdf_url": "https://arxiv.org/pdf/2511.20610v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 3,
            "Rigor": 3,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "提供了一个从零开始构建轨迹基础模型的实践教程，并对比了现有模型架构，有助于理解LLM类模型在时空数据上的应用与创新。",
        "reason_zh": "尽管标题是'从零开始构建'，但其内容不仅仅是代码实现，还深入探讨了如何将GPT-2等基础模型架构适应于高维时空轨迹数据，并对比了TrajFM和TrajGPT等模型的创新点。这对于理解LLM的泛化能力和理论机制在特定高维数据上的应用具有很强的指导意义，且清晰度极高。"
    },
    {
        "id": "http://arxiv.org/abs/2511.17865v1",
        "title": "Generative Model Predictive Control in Manufacturing Processes: A Review",
        "summary": "Manufacturing processes are inherently dynamic and uncertain, with varying parameters and nonlinear behaviors, making robust control essential for maintaining quality and reliability. Traditional control methods often fail under these conditions due to their reactive nature. Model Predictive Control (MPC) has emerged as a more advanced framework, leveraging process models to predict future states and optimize control actions. However, MPC relies on simplified models that often fail to capture complex dynamics, and it struggles with accurate state estimation and handling the propagation of uncertainty in manufacturing environments. Machine learning (ML) has been introduced to enhance MPC by modeling nonlinear dynamics and learning latent representations that support predictive modeling, state estimation, and optimization. Yet existing ML-driven MPC approaches remain deterministic and correlation-focused, motivating the exploration of generative. Generative ML offers new opportunities by learning data distributions, capturing hidden patterns, and inherently managing uncertainty, thereby complementing MPC. This review highlights five representative methods and examines how each has been integrated into MPC components, including predictive modeling, state estimation, and optimization. By synthesizing these cases, we outline the common ways generative ML can systematically enhance MPC and provide a framework for understanding its potential in diverse manufacturing processes. We identify key research gaps, propose future directions, and use a representative case to illustrate how generative ML-driven MPC can extend broadly across manufacturing. Taken together, this review positions generative ML not as an incremental add-on but as a transformative approach to reshape predictive control for next-generation manufacturing systems.",
        "authors": "Suk Ki Lee, Ronnie F. P. Stone, Max Gao, Wenlong Zhang, Zhenghui Sha, Hyunwoong Ko",
        "url": "http://arxiv.org/abs/2511.17865v1",
        "pdf_url": "https://arxiv.org/pdf/2511.17865v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 3,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "综述了生成式机器学习如何增强模型预测控制（MPC），特别是在不确定性管理方面的应用，为生成式AI与控制/强化学习的结合指明了方向。",
        "reason_zh": "这篇综述将生成式AI与模型预测控制（MPC，与强化学习有紧密联系）相结合，特别强调了不确定性管理，这与统计学背景高度相关。它探讨了生成式ML如何系统性地增强MPC，并提出了关键研究空白和未来方向，符合您对生成式AI和RL方向的兴趣。"
    }
]