[
    {
        "id": "http://arxiv.org/abs/2602.07851v1",
        "title": "Best Approximation Optimal Control for Infeasible Double Integrator and Douglas--Rachford Algorithm",
        "summary": "We consider the problem of finding (in some sense) the best approximation control for an infeasible double integrator. The control function is constrained by upper and lower bounds that are too tight and thus cause infeasibility. The infeasibility is characterized by a gap function (representing the separation between two constraint sets) whose squared ${\\cal L}^2$-norm is to be minimized to find the best approximation control solution. First, we review the existing results for problems involving a general linear control system. Then, for the infeasible double integrator problem, we present an analytical solution for the bang--bang control with at most one switching. The infinite-dimensional optimization problem is reduced to the problem of solving two algebraic equations in two variables, to compute the switching time and gap function. We discuss numerical approaches to solving the system of equations. Finally, we describe the (relaxed) Douglas--Rachford algorithm for the double integrator problem and carry out numerical experiments to illustrate the implementation of the algorithm and test performance.",
        "authors": "Regina S. Burachik, Bethany I. Caldwell, C. Yalçın Kaya, Walaa M. Moursi",
        "url": "http://arxiv.org/abs/2602.07851v1",
        "pdf_url": "https://arxiv.org/pdf/2602.07851v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "深入探讨Douglas-Rachford算法在最优控制问题中的应用，提供严格的数学推导和数值实验。",
        "reason_zh": "该论文聚焦于Douglas-Rachford算法，这是凸优化领域解决分裂问题（splitting problems）的核心算法之一。它提供了严格的数学分析和应用案例，非常适合博士生深入理解凸优化算法的理论基础和实际操作，补全数学拼图。其数学严谨性极高，对理解算法的收敛性和性质有重要价值。"
    },
    {
        "id": "http://arxiv.org/abs/2602.09848v1",
        "title": "Robust Processing and Learning: Principles, Methods, and Wireless Applications",
        "summary": "This tutorial-style overview article examines the fundamental principles and methods of robustness, using wireless sensing and communication (WSC) as the narrative and exemplifying framework. First, we formalize the conceptual and mathematical foundations of robustness, highlighting the interpretations and relations across robust statistics, optimization, and machine learning. Key techniques, such as robust estimation and testing, distributionally robust optimization, and regularized and adversary training, are investigated. Together, the costs of robustness in system design, for example, the compromised nominal performances and the extra computational burdens, are discussed. Second, we review recent robust signal processing solutions for WSC that address model mismatch, data scarcity, adversarial perturbation, and distributional shift. Specific applications include robust ranging-based localization, modality sensing, channel estimation, receive combining, waveform design, and federated learning. Through this effort, we aim to introduce the classical developments and recent advances in robustness theory to the general signal processing community, exemplifying how robust statistical, optimization, and machine learning approaches can address the uncertainties inherent in WSC systems.",
        "authors": "Shixiong Wang, Wei Dai, Li-Chun Wang, Geoffrey Ye Li",
        "url": "http://arxiv.org/abs/2602.09848v1",
        "pdf_url": "https://arxiv.org/pdf/2602.09848v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 5,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "以教程风格概述鲁棒性理论的数学基础和方法，涵盖鲁棒统计、优化和机器学习。",
        "reason_zh": "这是一篇教程风格的概述文章，系统地阐述了鲁棒性（Robustness）的数学概念、原理和方法，包括鲁棒估计、分布鲁棒优化等。这些是高维统计和优化中的核心基础，对统计学博士生理解不确定性下的模型行为至关重要，具有很高的数学严谨性和实用性。"
    },
    {
        "id": "http://arxiv.org/abs/2602.08791v1",
        "title": "Review of thermodynamic structures and structure-preserving discretisations of Cahn--Hilliard-type models",
        "summary": "The Cahn-Hilliard equation and extensions, notably the Cahn-Hilliard-Darcy and Cahn-Hilliard-Navier-Stokes systems, provide widely used frameworks for coupling interfacial thermodynamics with flow. This review surveys the thermodynamic structures underlying these models, focusing on the formulation of free energy functionals, dissipation mechanisms, and variational principles. We compare structural properties, emphasizing how these models encode conservation laws and energy dissipation. A central theme is the translation of these thermodynamic structures into numerical practice by providing representative discretisation strategies that aim to preserve mass conservation, stability, and energy decay. Particular attention is paid to the trade-offs between accuracy, efficiency, and structure preservation in large-scale simulations.",
        "authors": "Aaron Brunk, Marco F. P. ten Eikelder, Marvin Fritz, Dennis Höhn, Dennis Trautwein",
        "url": "http://arxiv.org/abs/2602.08791v1",
        "pdf_url": "https://arxiv.org/pdf/2602.08791v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "综述Cahn-Hilliard模型的热力学结构、变分原理和结构保持离散化方法。",
        "reason_zh": "尽管主题特定于Cahn-Hilliard模型，但这篇综述深入探讨了自由能泛函、耗散机制、变分原理以及结构保持离散化等高度数学化的概念。这些是数值分析和数学建模中的核心思想，对于希望在物理信息机器学习或科学计算领域补全数学基础的统计学博士生而言，是硬核且严谨的资料。"
    },
    {
        "id": "http://arxiv.org/abs/2602.09679v1",
        "title": "Real time filtering algorithms",
        "summary": "This paper presents a systematic review of recent advances in nonlinear filtering algorithms, structured into three principal categories: Kalman-type methods, Monte Carlo methods, and the Yau-Yau algorithm. For each category, we provide a comprehensive synthesis of theoretical developments, algorithmic variants, and practical applications that have emerged in recent years. Importantly, this review addresses both continuous-time and discrete-time system formulations, offering a unified review of filtering methodologies across different frameworks. Furthermore, our analysis reveals the transformative influence of artificial intelligence breakthroughs on the entire nonlinear filtering field, particularly in areas such as learning-based filters, neural network-augmented algorithms, and data-driven approaches.",
        "authors": "Chang Qin, Yikun Li, Ru Qian, Jiayi Kang, Yao Mao",
        "url": "http://arxiv.org/abs/2602.09679v1",
        "pdf_url": "https://arxiv.org/pdf/2602.09679v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "系统回顾非线性滤波算法的理论发展，包括卡尔曼型方法和蒙特卡洛方法。",
        "reason_zh": "这篇综述系统地回顾了非线性滤波算法，特别是卡尔曼滤波和蒙特卡洛方法（如粒子滤波），这些是高等概率论、随机过程和估计理论中的核心算法。它提供了理论发展和算法变体的综合分析，对于统计学博士生理解动态系统中的状态估计和随机过程建模具有重要的基础价值和数学严谨性。"
    },
    {
        "id": "http://arxiv.org/abs/2602.11785v1",
        "title": "Safe Fairness Guarantees Without Demographics in Classification: Spectral Uncertainty Set Perspective",
        "summary": "As automated classification systems become increasingly prevalent, concerns have emerged over their potential to reinforce and amplify existing societal biases. In the light of this issue, many methods have been proposed to enhance the fairness guarantees of classifiers. Most of the existing interventions assume access to group information for all instances, a requirement rarely met in practice. Fairness without access to demographic information has often been approached through robust optimization techniques,which target worst-case outcomes over a set of plausible distributions known as the uncertainty set. However, their effectiveness is strongly influenced by the chosen uncertainty set. In fact, existing approaches often overemphasize outliers or overly pessimistic scenarios, compromising both overall performance and fairness. To overcome these limitations, we introduce SPECTRE, a minimax-fair method that adjusts the spectrum of a simple Fourier feature mapping and constrains the extent to which the worst-case distribution can deviate from the empirical distribution. We perform extensive experiments on the American Community Survey datasets involving 20 states. The safeness of SPECTRE comes as it provides the highest average values on fairness guarantees together with the smallest interquartile range in comparison to state-of-the-art approaches, even compared to those with access to demographic group information. In addition, we provide a theoretical analysis that derives computable bounds on the worst-case error for both individual groups and the overall population, as well as characterizes the worst-case distributions responsible for these extremal performances",
        "authors": "Ainhize Barrainkua, Santiago Mazuelas, Novi Quadrianto, Jose A. Lozano",
        "url": "http://arxiv.org/abs/2602.11785v1",
        "pdf_url": "https://arxiv.org/pdf/2602.11785v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "从谱不确定性集角度，提供分类公平性保证的理论分析和可计算边界。",
        "reason_zh": "这篇论文虽然关注公平性这一前沿主题，但其核心贡献在于通过鲁棒优化技术和谱不确定性集，对分类器的公平性保证进行了深入的理论分析，并推导了可计算的误差边界。这种对鲁棒优化和理论边界的数学严谨性分析，对于统计学博士生理解高维统计和优化中的理论机制，具有重要的基础价值。"
    },
    {
        "id": "http://arxiv.org/abs/2602.12083v1",
        "title": "Differentiable Modal Logic for Multi-Agent Diagnosis, Orchestration and Communication",
        "summary": "As multi-agent AI systems evolve from simple chatbots to autonomous swarms, debugging semantic failures requires reasoning about knowledge, belief, causality, and obligation, precisely what modal logic was designed to formalize. However, traditional modal logic requires manual specification of relationship structures that are unknown or dynamic in real systems. This tutorial demonstrates differentiable modal logic (DML), implemented via Modal Logical Neural Networks (MLNNs), enabling systems to learn trust networks, causal chains, and regulatory boundaries from behavioral data alone.   We present a unified neurosymbolic debugging framework through four modalities: epistemic (who to trust), temporal (when events cause failures), deontic (what actions are permitted), and doxastic (how to interpret agent confidence). Each modality is demonstrated on concrete multi-agent scenarios, from discovering deceptive alliances in diplomacy games to detecting LLM hallucinations, with complete implementations showing how logical contradictions become learnable optimization objectives. Key contributions for the neurosymbolic community: (1) interpretable learned structures where trust and causality are explicit parameters, not opaque embeddings; (2) knowledge injection via differentiable axioms that guide learning with sparse data (3) compositional multi-modal reasoning that combines epistemic, temporal, and deontic constraints; and (4) practical deployment patterns for monitoring, active control and communication of multi-agent systems. All code provided as executable Jupyter notebooks.",
        "authors": "Antonin Sulc",
        "url": "http://arxiv.org/abs/2602.12083v1",
        "pdf_url": "https://arxiv.org/pdf/2602.12083v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 5,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "介绍可微分模态逻辑(DML)及其在多智能体AI系统调试中的应用，实现知识、信念、因果关系的学习。",
        "reason_zh": "这篇教程展示了可微分模态逻辑这一前沿概念，将其应用于多智能体AI系统的理论机制和调试。它结合了神经符号方法，能够学习信任网络和因果链，为LLM理论机制和多智能体系统提供了新的研究方向，具有极高的理论深度和创新性。"
    },
    {
        "id": "http://arxiv.org/abs/2602.11965v1",
        "title": "Manifold-Aware Temporal Domain Generalization for Large Language Models",
        "summary": "Temporal distribution shifts are pervasive in real-world deployments of Large Language Models (LLMs), where data evolves continuously over time. While Temporal Domain Generalization (TDG) seeks to model such structured evolution, existing approaches characterize model adaptation in the full parameter space. This formulation becomes computationally infeasible for modern LLMs. This paper introduces a geometric reformulation of TDG under parameter-efficient fine-tuning. We establish that the low-dimensional temporal structure underlying model evolution can be preserved under parameter-efficient reparameterization, enabling temporal modeling without operating in the ambient parameter space. Building on this principle, we propose Manifold-aware Temporal LoRA (MaT-LoRA), which constrains temporal updates to a shared low-dimensional manifold within a low-rank adaptation subspace, and models its evolution through a structured temporal core. This reparameterization dramatically reduces temporal modeling complexity while retaining expressive power. Extensive experiments on synthetic and real-world datasets, including scientific documents, news publishers, and review ratings, demonstrate that MaT-LoRA achieves superior temporal generalization performance with practical scalability for LLMs.",
        "authors": "Yiheng Yao, Zekun Cai, Xinyuan Song, Hiroki Hill Kobayashi, Xuan Song, Ryosuke Shibasaki, Liang Zhao",
        "url": "http://arxiv.org/abs/2602.11965v1",
        "pdf_url": "https://arxiv.org/pdf/2602.11965v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 5,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "提出流形感知的时序域泛化方法MaT-LoRA，解决LLM在时序分布漂移下的适应性问题。",
        "reason_zh": "针对LLM在实际部署中面临的时序分布漂移问题，该论文从几何角度重新构建了时序域泛化，并提出了MaT-LoRA。这代表了LLM理论机制和鲁棒性研究的前沿，具有很高的理论深度，对未来LLM的泛化能力和部署稳定性研究具有重要指导意义。"
    },
    {
        "id": "http://arxiv.org/abs/2602.11583v1",
        "title": "The Five Ws of Multi-Agent Communication: Who Talks to Whom, When, What, and Why -- A Survey from MARL to Emergent Language and LLMs",
        "summary": "Multi-agent sequential decision-making powers many real-world systems, from autonomous vehicles and robotics to collaborative AI assistants. In dynamic, partially observable environments, communication is often what reduces uncertainty and makes collaboration possible. This survey reviews multi-agent communication (MA-Comm) through the Five Ws: who communicates with whom, what is communicated, when communication occurs, and why communication is beneficial. This framing offers a clean way to connect ideas across otherwise separate research threads. We trace how communication approaches have evolved across three major paradigms. In Multi-Agent Reinforcement Learning (MARL), early methods used hand-designed or implicit protocols, followed by end-to-end learned communication optimized for reward and control. While successful, these protocols are frequently task-specific and hard to interpret, motivating work on Emergent Language (EL), where agents can develop more structured or symbolic communication through interaction. EL methods, however, still struggle with grounding, generalization, and scalability, which has fueled recent interest in large language models (LLMs) that bring natural language priors for reasoning, planning, and collaboration in more open-ended settings. Across MARL, EL, and LLM-based systems, we highlight how different choices shape communication design, where the main trade-offs lie, and what remains unsolved. We distill practical design patterns and open challenges to support future hybrid systems that combine learning, language, and control for scalable and interpretable multi-agent collaboration.",
        "authors": "Jingdi Chen, Hanqing Yang, Zongjun Liu, Carlee Joe-Wong",
        "url": "http://arxiv.org/abs/2602.11583v1",
        "pdf_url": "https://arxiv.org/pdf/2602.11583v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "综合回顾多智能体通信在MARL、涌现语言和LLM三大范式下的演变与挑战。",
        "reason_zh": "这是一篇非常全面的综述，以“五个W”的框架梳理了多智能体通信在不同AI范式下的发展。它不仅总结了现有方法，还深刻剖析了设计权衡和未解决的挑战，为多智能体强化学习、LLM理论机制以及未来混合系统的研究提供了广阔的视野和明确的方向。"
    },
    {
        "id": "http://arxiv.org/abs/2602.08586v2",
        "title": "PRISM: A Principled Framework for Multi-Agent Reasoning via Gain Decomposition",
        "summary": "Multi-agent collaboration has emerged as a promising paradigm for enhancing reasoning capabilities of Large Language Models (LLMs). However, existing approaches remain largely heuristic, lacking principled guidance on what drives performance gains and how to systematically optimize multi-agent reasoning. Specifically, it remains unclear why multi-agent collaboration outperforms single-agent reasoning and which design choices contribute most to these gains, making it difficult to build better systems.   We address this gap by introducing a unified theoretical framework that decomposes multi-agent reasoning gains into three conceptually independent dimensions: Exploration for diverse solution coverage, Information for high-fidelity feedback, and Aggregation for principled consensus. Through this lens, existing methods can be understood as special cases that optimize only subsets of these dimensions. Building upon this decomposition, a novel framework called PRISM (Propose-Review-Integrate Synthesis for Multi-agent Reasoning) is proposed, which jointly maximizes all three dimensions through role-based diversity, execution-grounded feedback with evidence-based cross-evaluation, and iterative synthesis with closed-loop validation. Extensive experiments across mathematical reasoning, code generation, and function calling benchmarks demonstrate that PRISM achieves state-of-the-art performance with superior compute-efficiency compared to methods optimizing partial dimensions. The theoretical framework provides actionable design principles for future multi-agent reasoning systems.",
        "authors": "Yiming Yang, Zhuoyuan Li, Fanxiang Zeng, Hao Fu, Yue Liu",
        "url": "http://arxiv.org/abs/2602.08586v2",
        "pdf_url": "https://arxiv.org/pdf/2602.08586v2",
        "type": "前沿深度",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "提出PRISM框架，通过分解多智能体推理增益为探索、信息和聚合三个维度，系统优化LLM协作推理。",
        "reason_zh": "该论文提出了一个原则性的框架PRISM，通过理论分解多智能体推理的增益来源，解决了现有方法启发式、缺乏系统优化的痛点。它为LLM的多智能体协作推理提供了理论指导和实践范式，具有很高的理论深度和创新性，对未来多智能体系统设计具有重要启发。"
    },
    {
        "id": "http://arxiv.org/abs/2602.08019v1",
        "title": "The Rise of Sparse Mixture-of-Experts: A Survey from Algorithmic Foundations to Decentralized Architectures and Vertical Domain Applications",
        "summary": "The sparse Mixture of Experts(MoE) architecture has evolved as a powerful approach for scaling deep learning models to more parameters with comparable computation cost. As an important branch of large language model(LLM), MoE model only activate a subset of experts based on a routing network. This sparse conditional computation mechanism significantly improves computational efficiency, paving a promising path for greater scalability and cost-efficiency. It not only enhance downstream applications such as natural language processing, computer vision, and multimodal in various horizontal domains, but also exhibit broad applicability across vertical domains. Despite the growing popularity and application of MoE models across various domains, there lacks a systematic exploration of recent advancements of MoE in many important fields. Existing surveys on MoE suffer from limitations such as lack coverage or none extensively exploration of key areas. This survey seeks to fill these gaps. In this paper, Firstly, we examine the foundational principles of MoE, with an in-depth exploration of its core components-the routing network and expert network. Subsequently, we extend beyond the centralized paradigm to the decentralized paradigm, which unlocks the immense untapped potential of decentralized infrastructure, enables democratization of MoE development for broader communities, and delivers greater scalability and cost-efficiency. Furthermore we focus on exploring its vertical domain applications. Finally, we also identify key challenges and promising future research directions. To the best of our knowledge, this survey is currently the most comprehensive review in the field of MoE. We aim for this article to serve as a valuable resource for both researchers and practitioners, enabling them to navigate and stay up-to-date with the latest advancements.",
        "authors": "Dong Pan, Bingtao Li, Yongsheng Zheng, Jiren Ma, Victor Fei",
        "url": "http://arxiv.org/abs/2602.08019v1",
        "pdf_url": "https://arxiv.org/pdf/2602.08019v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "全面综述稀疏MoE架构从算法基础到去中心化部署和垂直领域应用的最新进展。",
        "reason_zh": "MoE架构是LLM扩展性和效率的关键技术。这篇综述全面覆盖了MoE的算法基础、去中心化架构以及在不同领域的应用，填补了现有综述的空白。它为理解LLM的理论机制、扩展性挑战以及未来架构方向提供了深入的洞察，具有极高的实用性和前瞻性。"
    }
]