[
    {
        "id": "http://arxiv.org/abs/2601.10583v1",
        "title": "Combinatorial Optimization Augmented Machine Learning",
        "summary": "Combinatorial optimization augmented machine learning (COAML) has recently emerged as a powerful paradigm for integrating predictive models with combinatorial decision-making. By embedding combinatorial optimization oracles into learning pipelines, COAML enables the construction of policies that are both data-driven and feasibility-preserving, bridging the traditions of machine learning, operations research, and stochastic optimization. This paper provides a comprehensive overview of the state of the art in COAML. We introduce a unifying framework for COAML pipelines, describe their methodological building blocks, and formalize their connection to empirical cost minimization. We then develop a taxonomy of problem settings based on the form of uncertainty and decision structure. Using this taxonomy, we review algorithmic approaches for static and dynamic problems, survey applications across domains such as scheduling, vehicle routing, stochastic programming, and reinforcement learning, and synthesize methodological contributions in terms of empirical cost minimization, imitation learning, and reinforcement learning. Finally, we identify key research frontiers. This survey aims to serve both as a tutorial introduction to the field and as a roadmap for future research at the interface of combinatorial optimization and machine learning.",
        "authors": "Maximilian Schiffer, Heiko Hoppe, Yue Su, Louis Bouvier, Axel Parmentier",
        "url": "http://arxiv.org/abs/2601.10583v1",
        "pdf_url": "https://arxiv.org/pdf/2601.10583v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "结合组合优化与机器学习的最新范式综述，指引跨学科研究方向。",
        "reason_zh": "这篇综述提供了COAML（Combinatorial Optimization Augmented Machine Learning）的统一框架、方法论构建块和研究前沿，融合了机器学习、运筹学和随机优化。对于希望在高维统计、Offline RL等领域寻找新研究方向的博士生来说，它具有极高的启发性，理论深度高，视野开阔，能有效指引未来的研究方向。"
    },
    {
        "id": "http://arxiv.org/abs/2601.10122v1",
        "title": "Role-Playing Agents Driven by Large Language Models: Current Status, Challenges, and Future Trends",
        "summary": "In recent years, with the rapid advancement of large language models (LLMs), role-playing language agents (RPLAs) have emerged as a prominent research focus at the intersection of natural language processing (NLP) and human-computer interaction. This paper systematically reviews the current development and key technologies of RPLAs, delineating the technological evolution from early rule-based template paradigms, through the language style imitation stage, to the cognitive simulation stage centered on personality modeling and memory mechanisms. It summarizes the critical technical pathways supporting high-quality role-playing, including psychological scale-driven character modeling, memory-augmented prompting mechanisms, and motivation-situation-based behavioral decision control. At the data level, the paper further analyzes the methods and challenges of constructing role-specific corpora, focusing on data sources, copyright constraints, and structured annotation processes. In terms of evaluation, it collates multi-dimensional assessment frameworks and benchmark datasets covering role knowledge, personality fidelity, value alignment, and interactive hallucination, while commenting on the advantages and disadvantages of methods such as human evaluation, reward models, and LLM-based scoring. Finally, the paper outlines future development directions of role-playing agents, including personality evolution modeling, multi-agent collaborative narrative, multimodal immersive interaction, and integration with cognitive neuroscience, aiming to provide a systematic perspective and methodological insights for subsequent research.",
        "authors": "Ye Wang, Jiaxing Chen, Hongjiang Xiao",
        "url": "http://arxiv.org/abs/2601.10122v1",
        "pdf_url": "https://arxiv.org/pdf/2601.10122v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 3,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "系统梳理LLM角色扮演智能体的技术演进、关键技术与未来趋势。",
        "reason_zh": "这篇论文对LLM角色扮演智能体进行了系统性综述，深入探讨了其技术演进、核心机制（如人格建模、记忆机制）和未来发展方向。对于关注LLM理论机制和未来研究的博士生来说，是了解该领域前沿的绝佳资料，能帮助您把握LLM智能体研究的脉络和潜在突破点。"
    },
    {
        "id": "http://arxiv.org/abs/2601.09113v1",
        "title": "The AI Hippocampus: How Far are We From Human Memory?",
        "summary": "Memory plays a foundational role in augmenting the reasoning, adaptability, and contextual fidelity of modern Large Language Models and Multi-Modal LLMs. As these models transition from static predictors to interactive systems capable of continual learning and personalized inference, the incorporation of memory mechanisms has emerged as a central theme in their architectural and functional evolution. This survey presents a comprehensive and structured synthesis of memory in LLMs and MLLMs, organizing the literature into a cohesive taxonomy comprising implicit, explicit, and agentic memory paradigms. Specifically, the survey delineates three primary memory frameworks. Implicit memory refers to the knowledge embedded within the internal parameters of pre-trained transformers, encompassing their capacity for memorization, associative retrieval, and contextual reasoning. Recent work has explored methods to interpret, manipulate, and reconfigure this latent memory. Explicit memory involves external storage and retrieval components designed to augment model outputs with dynamic, queryable knowledge representations, such as textual corpora, dense vectors, and graph-based structures, thereby enabling scalable and updatable interaction with information sources. Agentic memory introduces persistent, temporally extended memory structures within autonomous agents, facilitating long-term planning, self-consistency, and collaborative behavior in multi-agent systems, with relevance to embodied and interactive AI. Extending beyond text, the survey examines the integration of memory within multi-modal settings, where coherence across vision, language, audio, and action modalities is essential. Key architectural advances, benchmark tasks, and open challenges are discussed, including issues related to memory capacity, alignment, factual consistency, and cross-system interoperability.",
        "authors": "Zixia Jia, Jiaqi Li, Yipeng Kang, Yuxuan Wang, Tong Wu, Quansen Wang, Xiaobo Wang, Shuyi Zhang, Junzhe Shen, Qing Li, Siyuan Qi, Yitao Liang, Di He, Zilong Zheng, Song-Chun Zhu",
        "url": "http://arxiv.org/abs/2601.09113v1",
        "pdf_url": "https://arxiv.org/pdf/2601.09113v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 3,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "深入剖析LLM和MLLM中记忆机制的综合性综述，揭示其架构与功能演变。",
        "reason_zh": "该综述系统地分类并合成了LLM和多模态LLM中的记忆范式，包括隐式、显式和智能体记忆。它讨论了关键架构进展、基准任务和开放挑战，对于理解LLM的深层机制、弥补LLM理论机制的认知空白以及探索未来研究方向至关重要。"
    },
    {
        "id": "http://arxiv.org/abs/2601.08787v1",
        "title": "A survey on sampling recovery",
        "summary": "The reconstruction of unknown functions from a finite number of samples is a fundamental challenge in pure and applied mathematics. This survey provides a comprehensive overview of recent developments in sampling recovery, focusing on the accuracy of various algorithms and the relationship between optimal recovery errors, nonlinear approximation, and the Kolmogorov widths of function classes. A central theme is the synergy between the theory of universal sampling discretization and Lebesgue-type inequalities for greedy algorithms. We discuss three primary algorithmic frameworks: weighted least squares and $\\ell_p$ minimization, sparse approximation methods, and greedy algorithms such as the Weak Orthogonal Matching Pursuit (WOMP) in Hilbert spaces and the Weak Tchebychev Greedy Algorithm (WCGA) in Banach spaces. These methods are applied to function classes defined by structural conditions, like the $A_β^r$ and Wiener-type classes, as well as classical Sobolev-type classes with dominated mixed derivatives. Notably, we highlight recent findings showing that nonlinear sampling recovery can provide superior error guarantees compared to linear methods for certain multivariate function classes.",
        "authors": "F. Dai, V. Temlyakov",
        "url": "http://arxiv.org/abs/2601.08787v1",
        "pdf_url": "https://arxiv.org/pdf/2601.08787v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "全面回顾采样恢复领域的最新进展，探讨最优恢复误差与函数类理论。",
        "reason_zh": "这篇综述深入探讨了从有限样本重建未知函数的理论，关注最优恢复误差、非线性逼近和Kolmogorov宽度等概念。其高度的数学严谨性与高维统计领域紧密相关，能为博士生提供扎实的理论基础和前沿研究视角，是补全高维统计理论拼图的硬核资料。"
    },
    {
        "id": "http://arxiv.org/abs/2601.09822v1",
        "title": "LLM-Based Agentic Systems for Software Engineering: Challenges and Opportunities",
        "summary": "Despite recent advancements in Large Language Models (LLMs), complex Software Engineering (SE) tasks require more collaborative and specialized approaches. This concept paper systematically reviews the emerging paradigm of LLM-based multi-agent systems, examining their applications across the Software Development Life Cycle (SDLC), from requirements engineering and code generation to static code checking, testing, and debugging. We delve into a wide range of topics such as language model selection, SE evaluation benchmarks, state-of-the-art agentic frameworks and communication protocols. Furthermore, we identify key challenges and outline future research opportunities, with a focus on multi-agent orchestration, human-agent coordination, computational cost optimization, and effective data collection. This work aims to provide researchers and practitioners with valuable insights into the current forefront landscape of agentic systems within the software engineering domain.",
        "authors": "Yongjian Tang, Thomas Runkler",
        "url": "http://arxiv.org/abs/2601.09822v1",
        "pdf_url": "https://arxiv.org/pdf/2601.09822v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 3,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "系统回顾LLM驱动的智能体系统在软件工程中的应用、挑战与机遇。",
        "reason_zh": "这篇概念性论文系统地回顾了LLM多智能体系统在软件开发生命周期中的应用，并指出了关键挑战和未来的研究机会。虽然应用领域是软件工程，但其对LLM智能体范式的探讨和对未来研究方向的指引，使其成为LLM理论机制前沿研究的良好补充，能提供跨领域视角。"
    },
    {
        "id": "http://arxiv.org/abs/2601.10222v1",
        "title": "Introduction to optimization methods for training SciML models",
        "summary": "Optimization is central to both modern machine learning (ML) and scientific machine learning (SciML), yet the structure of the underlying optimization problems differs substantially across these domains. Classical ML typically relies on stochastic, sample-separable objectives that favor first-order and adaptive gradient methods. In contrast, SciML often involves physics-informed or operator-constrained formulations in which differential operators induce global coupling, stiffness, and strong anisotropy in the loss landscape. As a result, optimization behavior in SciML is governed by the spectral properties of the underlying physical models rather than by data statistics, frequently limiting the effectiveness of standard stochastic methods and motivating deterministic or curvature-aware approaches. This document provides a unified introduction to optimization methods in ML and SciML, emphasizing how problem structure shapes algorithmic choices. We review first- and second-order optimization techniques in both deterministic and stochastic settings, discuss their adaptation to physics-constrained and data-driven SciML models, and illustrate practical strategies through tutorial examples, while highlighting open research directions at the interface of scientific computing and scientific machine learning.",
        "authors": "Alena Kopaničáková, Elisa Riccietti",
        "url": "http://arxiv.org/abs/2601.10222v1",
        "pdf_url": "https://arxiv.org/pdf/2601.10222v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "统一介绍ML和SciML中的优化方法，强调问题结构对算法选择的影响。",
        "reason_zh": "这篇教程深入探讨了机器学习和科学机器学习中优化方法的结构差异，回顾了一阶和二阶优化技术，并强调了物理模型谱特性对优化行为的影响。它具有高度的数学严谨性，是理解凸优化及更高级优化方法在复杂系统（如SciML）中应用的硬核资料，能帮助博士生补全优化理论的数学拼图。"
    },
    {
        "id": "http://arxiv.org/abs/2601.10184v1",
        "title": "Discrete versus continuous -- lattice models and their exact continuous counterparts",
        "summary": "We review and study the correspondence between discrete lattice/chain models of interacting particles and their continuous counterparts represented by partial differential equations. We study the correspondence problem for nearest neighbour interaction lattice models as well as for multiple-neighbour interaction lattice models, and we gradually proceed from infinite lattices to periodic lattices and finally to finite lattices with fixed ends/zero Dirichlet boundary conditions. The whole study is framed as systematic specialisation of Fourier analysis tools from the continuous to the discrete setting and vice versa, and the correspondence between the discrete and continuous models is examined primarily with regard to the dispersion relation.",
        "authors": "Lorenzo Fusi, Oliver Křenek, Vít Průša, Casey Rodriguez, Rebecca Tozzi, Martin Vejvoda",
        "url": "http://arxiv.org/abs/2601.10184v1",
        "pdf_url": "https://arxiv.org/pdf/2601.10184v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "综述并研究离散格点模型与连续偏微分方程之间的对应关系，侧重傅里叶分析。",
        "reason_zh": "这篇论文通过傅里叶分析工具，系统地研究了离散与连续模型之间的对应关系，并探讨了色散关系。它提供了数学上严谨的视角，对于补全博士生在矩阵分析、高等概率论（特别是随机过程的离散-连续对应）等方面的数学基础非常有价值，是深入理解数学工具的硬核资料。"
    },
    {
        "id": "http://arxiv.org/abs/2601.08662v1",
        "title": "From Classical to Quantum Reinforcement Learning and Its Applications in Quantum Control: A Beginner's Tutorial",
        "summary": "This tutorial is designed to make reinforcement learning (RL) more accessible to undergraduate students by offering clear, example-driven explanations. It focuses on bridging the gap between RL theory and practical coding applications, addressing common challenges that students face when transitioning from conceptual understanding to implementation. Through hands-on examples and approachable explanations, the tutorial aims to equip students with the foundational skills needed to confidently apply RL techniques in real-world scenarios.",
        "authors": "Abhijit Sen, Sonali Panda, Mahima Arya, Subhajit Patra, Zizhan Zheng, Denys I. Bondar",
        "url": "http://arxiv.org/abs/2601.08662v1",
        "pdf_url": "https://arxiv.org/pdf/2601.08662v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "从经典到量子强化学习的入门教程，强调理论与实践的结合。",
        "reason_zh": "尽管标题包含“Beginner's Tutorial”，但它旨在弥合RL理论与实际应用之间的鸿沟，并扩展到前沿的量子强化学习。这表明它将以数学严谨的方式介绍经典RL的基础，同时展望未来，非常适合作为高等概率论/随机过程背景下的RL核心基础，是理解Offline RL理论前的重要铺垫。"
    },
    {
        "id": "http://arxiv.org/abs/2601.07619v1",
        "title": "Speaking of Opinions: Comparing Approaches to Modelling Opinion Manipulation",
        "summary": "This review outlines the major approaches to modelling opinion formation and manipulation in mathematics and computer science. Key tools such as ordinary and partial differential equations, stochastic models, control theory, and interaction protocols are introduced and compared as methods for describing manipulation. The review is separated into those models using a continuous opinion space and those using discrete or binary opinions, with the advantages and disadvantages of each discussed. Finally, the authors provide an interdisciplinary perspective on the field of opinion dynamics and its social significance.",
        "authors": "Luisa Estrada, Sasha Glendinning, Andrew Nugent",
        "url": "http://arxiv.org/abs/2601.07619v1",
        "pdf_url": "https://arxiv.org/pdf/2601.07619v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "概述数学和计算机科学中建模意见形成和操纵的主要方法，涉及ODE、PDE和随机模型。",
        "reason_zh": "这篇综述介绍了使用常微分方程、偏微分方程、随机模型和控制理论等核心数学工具来描述复杂系统的方法。虽然应用领域是社会科学，但其对数学建模工具的深入探讨和比较，使其成为高等概率论/随机过程和数学建模基础的优秀补充资料，能帮助博士生强化数学工具的使用能力。"
    },
    {
        "id": "http://arxiv.org/abs/2601.07013v1",
        "title": "Conditional Normalizing Flows for Forward and Backward Joint State and Parameter Estimation",
        "summary": "Traditional filtering algorithms for state estimation -- such as classical Kalman filtering, unscented Kalman filtering, and particle filters - show performance degradation when applied to nonlinear systems whose uncertainty follows arbitrary non-Gaussian, and potentially multi-modal distributions. This study reviews recent approaches to state estimation via nonlinear filtering based on conditional normalizing flows, where the conditional embedding is generated by standard MLP architectures, transformers or selective state-space models (like Mamba-SSM). In addition, we test the effectiveness of an optimal-transport-inspired kinetic loss term in mitigating overparameterization in flows consisting of a large collection of transformations. We investigate the performance of these approaches on applications relevant to autonomous driving and patient population dynamics, paying special attention to how they handle time inversion and chained predictions. Finally, we assess the performance of various conditioning strategies for an application to real-world COVID-19 joint SIR system forecasting and parameter estimation.",
        "authors": "Luke S. Lagunowich, Guoxiang Grayson Tong, Daniele E. Schiavazzi",
        "url": "http://arxiv.org/abs/2601.07013v1",
        "pdf_url": "https://arxiv.org/pdf/2601.07013v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "综述基于条件归一化流的状态与参数联合估计方法，应对非高斯非线性系统。",
        "reason_zh": "这篇论文回顾了利用条件归一化流进行状态估计的最新方法，特别是在处理非线性、非高斯和多模态不确定性系统时的应用。它涉及传统滤波算法、现代ML技术与贝叶斯推断的结合，是高等概率论/随机过程和贝叶斯推断基础的硬核延伸，能帮助博士生理解如何将严谨的理论应用于复杂且实际的问题。"
    }
]