[
    {
        "id": "http://arxiv.org/abs/2601.02749v1",
        "title": "The Path Ahead for Agentic AI: Challenges and Opportunities",
        "summary": "The evolution of Large Language Models (LLMs) from passive text generators to autonomous, goal-driven systems represents a fundamental shift in artificial intelligence. This chapter examines the emergence of agentic AI systems that integrate planning, memory, tool use, and iterative reasoning to operate autonomously in complex environments. We trace the architectural progression from statistical models to transformer-based systems, identifying capabilities that enable agentic behavior: long-range reasoning, contextual awareness, and adaptive decision-making. The chapter provides three contributions: (1) a synthesis of how LLM capabilities extend toward agency through reasoning-action-reflection loops; (2) an integrative framework describing core components perception, memory, planning, and tool execution that bridge LLMs with autonomous behavior; (3) a critical assessment of applications and persistent challenges in safety, alignment, reliability, and sustainability. Unlike existing surveys, we focus on the architectural transition from language understanding to autonomous action, emphasizing the technical gaps that must be resolved before deployment. We identify critical research priorities, including verifiable planning, scalable multi-agent coordination, persistent memory architectures, and governance frameworks. Responsible advancement requires simultaneous progress in technical robustness, interpretability, and ethical safeguards to realize potential while mitigating risks of misalignment and unintended consequences.",
        "authors": "Nadia Sibai, Yara Ahmed, Serry Sibaee, Sawsan AlHalawani, Adel Ammar, Wadii Boulila",
        "url": "http://arxiv.org/abs/2601.02749v1",
        "pdf_url": "https://arxiv.org/pdf/2601.02749v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "全面审视Agentic AI的演进路径、核心能力、挑战与未来研究方向。",
        "reason_zh": "这篇综述深入探讨了Agentic AI系统的演变，从LLM到自主智能体的架构进展，详细分析了规划、记忆、工具使用和迭代推理等核心能力。它提供了一个整合框架，并评估了应用与挑战，对于理解LLM代理的最新进展和指引未来研究方向具有极高价值。"
    },
    {
        "id": "http://arxiv.org/abs/2601.01743v1",
        "title": "AI Agent Systems: Architectures, Applications, and Evaluation",
        "summary": "AI agents -- systems that combine foundation models with reasoning, planning, memory, and tool use -- are rapidly becoming a practical interface between natural-language intent and real-world computation. This survey synthesizes the emerging landscape of AI agent architectures across: (i) deliberation and reasoning (e.g., chain-of-thought-style decomposition, self-reflection and verification, and constraint-aware decision making), (ii) planning and control (from reactive policies to hierarchical and multi-step planners), and (iii) tool calling and environment interaction (retrieval, code execution, APIs, and multimodal perception). We organize prior work into a unified taxonomy spanning agent components (policy/LLM core, memory, world models, planners, tool routers, and critics), orchestration patterns (single-agent vs.\\ multi-agent; centralized vs.\\ decentralized coordination), and deployment settings (offline analysis vs.\\ online interactive assistance; safety-critical vs.\\ open-ended tasks). We discuss key design trade-offs -- latency vs.\\ accuracy, autonomy vs.\\ controllability, and capability vs.\\ reliability -- and highlight how evaluation is complicated by non-determinism, long-horizon credit assignment, tool and environment variability, and hidden costs such as retries and context growth. Finally, we summarize measurement and benchmarking practices (task suites, human preference and utility metrics, success under constraints, robustness and security) and identify open challenges including verification and guardrails for tool actions, scalable memory and context management, interpretability of agent decisions, and reproducible evaluation under realistic workloads.",
        "authors": "Bin Xu",
        "url": "http://arxiv.org/abs/2601.01743v1",
        "pdf_url": "https://arxiv.org/pdf/2601.01743v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "深入剖析AI代理系统的架构、应用与评估，提供统一的分类学框架。",
        "reason_zh": "这篇综述系统地梳理了AI代理系统的新兴格局，涵盖了推理、规划、工具调用等关键方面，并提出了统一的分类学。它详细讨论了设计权衡和评估挑战，与前一篇互补，为深入研究LLM代理的理论机制和实现提供了坚实基础。"
    },
    {
        "id": "http://arxiv.org/abs/2601.05152v1",
        "title": "Safe Continual Reinforcement Learning Methods for Nonstationary Environments. Towards a Survey of the State of the Art",
        "summary": "This work provides a state-of-the-art survey of continual safe online reinforcement learning (COSRL) methods. We discuss theoretical aspects, challenges, and open questions in building continual online safe reinforcement learning algorithms. We provide the taxonomy and the details of continual online safe reinforcement learning methods based on the type of safe learning mechanism that takes adaptation to nonstationarity into account. We categorize safety constraints formulation for online reinforcement learning algorithms, and finally, we discuss prospects for creating reliable, safe online learning algorithms.   Keywords: safe RL in nonstationary environments, safe continual reinforcement learning under nonstationarity, HM-MDP, NSMDP, POMDP, safe POMDP, constraints for continual learning, safe continual reinforcement learning review, safe continual reinforcement learning survey, safe continual reinforcement learning, safe online learning under distribution shift, safe continual online adaptation, safe reinforcement learning, safe exploration, safe adaptation, constrained Markov decision processes, safe reinforcement learning, partially observable Markov decision process, safe reinforcement learning and hidden Markov decision processes, Safe Online Reinforcement Learning, safe online reinforcement learning, safe online reinforcement learning, safe meta-learning, safe meta-reinforcement learning, safe context-based reinforcement learning, formulating safety constraints for continual learning",
        "authors": "Timofey Tomashevskiy",
        "url": "http://arxiv.org/abs/2601.05152v1",
        "pdf_url": "https://arxiv.org/pdf/2601.05152v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "综述非稳态环境下安全持续强化学习的最新进展、挑战与未来方向。",
        "reason_zh": "这是一篇关于非稳态环境中安全持续强化学习（COSRL）的最新综述。它讨论了理论、挑战和开放问题，并提供了基于安全学习机制的分类法。对于关注Offline RL、安全RL和适应非稳态环境的博士生来说，是理解该领域前沿和未来研究方向的绝佳资源。"
    },
    {
        "id": "http://arxiv.org/abs/2601.01490v1",
        "title": "Distortion Instead of Hallucination: The Effect of Reasoning Under Strict Constraints",
        "summary": "With the widespread adoption of large language models (LLMs), hallucinations, which are non-factual fabrications in model outputs, have become serious concerns. Reasoning capabilities have received attention as a self-verification process to improve output reliability. However, the effect of reasoning within a closed system where LLMs cannot rely on external tools or knowledge has yet to be clarified. We therefore conduct experiments under strict constraints (recommending peer-reviewed journal articles in computer science) to examine the effect of reasoning across multiple models (GPT-5.2 and Gemini 3 Flash). Our results reveal a problematic trade-off between constraint compliance and factual accuracy. Non-reasoning models exhibit high constraint violation rates (66-75%) but maintain factual accuracy, while reasoning models reduce violations (13-26%) but systematically distort known facts to satisfy constraints and increase complete fabrication. This trade-off pattern is consistent across both models despite different architectures, indicating a fundamental limitation of reasoning. Furthermore, reasoning does not uniformly improve output authenticity: effects diverge by model, reflecting different allocations of the compliance-truthfulness trade-off. These findings challenge the assumption that reasoning universally improves reliability: reasoning models trade honest constraint violations for detection-resistant distortions.",
        "authors": "Junichiro Niimi",
        "url": "http://arxiv.org/abs/2601.01490v1",
        "pdf_url": "https://arxiv.org/pdf/2601.01490v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 5,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "揭示LLM在严格约束下推理时，可能以“扭曲事实”而非“幻觉”的方式满足约束的深层机制。",
        "reason_zh": "这项研究深入探讨了LLM在严格约束下进行推理时，可能出现的“扭曲”而非传统“幻觉”现象。它揭示了LLM在遵循约束和保持事实准确性之间的权衡，对于理解LLM的理论机制、局限性以及如何构建更可靠的LLM系统具有重要的启发性。"
    },
    {
        "id": "http://arxiv.org/abs/2601.02814v1",
        "title": "Causal-Enhanced AI Agents for Medical Research Screening",
        "summary": "Systematic reviews are essential for evidence-based medicine, but reviewing 1.5 million+ annual publications manually is infeasible. Current AI approaches suffer from hallucinations in systematic review tasks, with studies reporting rates ranging from 28--40% for earlier models to 2--15% for modern implementations which is unacceptable when errors impact patient care.   We present a causal graph-enhanced retrieval-augmented generation system integrating explicit causal reasoning with dual-level knowledge graphs. Our approach enforces evidence-first protocols where every causal claim traces to retrieved literature and automatically generates directed acyclic graphs visualizing intervention-outcome pathways.   Evaluation on 234 dementia exercise abstracts shows CausalAgent achieves 95% accuracy, 100% retrieval success, and zero hallucinations versus 34% accuracy and 10% hallucinations for baseline AI. Automatic causal graphs enable explicit mechanism modeling, visual synthesis, and enhanced interpretability. While this proof-of-concept evaluation used ten questions focused on dementia exercise research, the architectural approach demonstrates transferable principles for trustworthy medical AI and causal reasoning's potential for high-stakes healthcare.",
        "authors": "Duc Ngo, Arya Rahgoza",
        "url": "http://arxiv.org/abs/2601.02814v1",
        "pdf_url": "https://arxiv.org/pdf/2601.02814v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "提出一种因果图增强的AI代理系统，通过显式因果推理解决LLM在医疗研究筛选中的幻觉问题。",
        "reason_zh": "这篇论文提出了一种结合因果图和检索增强生成（RAG）的AI代理系统，旨在解决LLM在医疗研究筛选中常见的幻觉问题。它强调证据溯源和自动生成有向无环图（DAGs），完美结合了“因果推断”和“LLM理论机制”两大兴趣点，为将因果推断应用于LLM代理以提高其在高风险领域的可靠性提供了具体且严谨的范例。"
    },
    {
        "id": "http://arxiv.org/abs/2601.04447v1",
        "title": "When Predictions Shape Reality: A Socio-Technical Synthesis of Performative Predictions in Machine Learning",
        "summary": "Machine learning models are increasingly used in high-stakes domains where their predictions can actively shape the environments in which they operate, a phenomenon known as performative prediction. This dynamic, in which the deployment of the model influences the very outcome it seeks to predict, can lead to unintended consequences, including feedback loops, performance issues, and significant societal risks. While the literature in the field has grown rapidly in recent years, a socio-technical synthesis that systemises the phenomenon concepts and provides practical guidance has been lacking. This Systematisation of Knowledge (SoK) addresses this gap by providing a comprehensive review of the literature on performative predictions. We provide an overview of the primary mechanisms through which performativity manifests, present a typology of associated risks, and survey the proposed solutions offered in the literature. Our primary contribution is the ``Performative Strength vs. Impact Matrix\" assessment framework. This practical tool is designed to help practitioners assess the potential influence and severity of performativity on their deployed predictive models and select the appropriate level of algorithmic or human intervention.",
        "authors": "Gal Fybish, Teo Susnjak",
        "url": "http://arxiv.org/abs/2601.04447v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04447v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 4
        },
        "core_value_zh": "系统梳理机器学习中“可执行预测”现象的机制、风险与解决方案，提供评估框架。",
        "reason_zh": "这是一篇关于机器学习中“可执行预测”（Performative Prediction）现象的知识系统化（SoK）综述。它提供了该现象发生的主要机制、相关风险类型以及文献中提出的解决方案。尽管不是纯数学教程，但该现象对因果推断和统计模型设计有深刻的理论影响，能帮助博士生理解ML模型在现实世界中的复杂反馈循环，补全其在ML理论与实践结合方面的知识拼图。"
    },
    {
        "id": "http://arxiv.org/abs/2601.04112v2",
        "title": "Algebraic Multigrid with Overlapping Schwarz Smoothers and Local Spectral Coarse Grids for Least Squares Problems",
        "summary": "This paper develops a new algebraic multigrid (AMG) method for sparse least-squares systems of the form $A=G^TG$ motivated by challenging applications in scientific computing where classical AMG methods fail. First we review and relate the use of local spectral problems in distinct fields of literature on AMG, domain decomposition (DD), and multiscale finite elements. We then propose a new approach blending aggregation-based coarsening, overlapping Schwarz smoothers, and locally constructed spectral coarse spaces. By exploiting the factorized structure of $A$, we construct an inexpensive symmetric positive semidefinite splitting that yields local generalized eigenproblems whose solutions define sparse, nonoverlapping coarse basis functions. This enables a fully algebraic and naturally recursive multilevel hierarchy that can either coarsen slowly to achieve AMG-like operator complexities, or coarsen aggressively-with correspondingly larger local spectral problems-to ensure robustness on problems that cannot be solved by existing AMG methods. The method requires no geometric information, avoids global eigenvalue solves, and maintains efficient parallelizable setup through localized operations. Numerical experiments demonstrate that the proposed least-squares AMG-DD method achieves convergence rates independent of anisotropy on rotated diffusion problems and remains scalable with problem size, while for small amounts of anisotropy we obtain convergence and operator complexities comparable with classical AMG methods. Most notably, for extremely anisotropic heat conduction operators arising in magnetic confinement fusion, where AMG and smoothed aggregation fail to reduce the residual even marginally, our method provides robust and efficient convergence across many orders of magnitude in anisotropy strength.",
        "authors": "Ben S. Southworth, Hussam Al Daas, Golo A. Wimmer, Ed Threlfall",
        "url": "http://arxiv.org/abs/2601.04112v2",
        "pdf_url": "https://arxiv.org/pdf/2601.04112v2",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Clarity": 3,
            "Utility": 3
        },
        "core_value_zh": "发展一种新的代数多重网格方法，用于求解稀疏最小二乘系统，并回顾了相关局部谱问题。",
        "reason_zh": "这篇论文提出了一种新的代数多重网格（AMG）方法来解决稀疏最小二乘系统。它回顾了AMG、域分解（DD）和多尺度有限元中局部谱问题的应用。虽然是研究论文，但其涉及的数值线性代数和大规模系统求解技术与“矩阵分析”紧密相关，对于需要补全数值计算方面博士数学拼图的学生具有一定的理论和方法学参考价值。"
    },
    {
        "id": "http://arxiv.org/abs/2601.01317v1",
        "title": "Benchmarking Continuous Dynamic Multi-Objective Optimization: Survey and Generalized Test Suite",
        "summary": "Dynamic multi-objective optimization (DMOO) has recently attracted increasing interest from both academic researchers and engineering practitioners, as numerous real-world applications that evolve over time can be naturally formulated as dynamic multi-objective optimization problems (DMOPs). This growing trend necessitates advanced benchmarks for the rigorous evaluation of optimization algorithms under realistic conditions. This paper introduces a comprehensive and principled framework for constructing highly realistic and challenging DMOO benchmarks. The proposed framework features several novel components: a generalized formulation that allows the Pareto-optimal Set (PS) to change on hypersurfaces, a mechanism for creating controlled variable contribution imbalances to generate heterogeneous landscapes, and dynamic rotation matrices for inducing time-varying variable interactions and non-separability. Furthermore, we incorporate a temporal perturbation mechanism to simulate irregular environmental changes and propose a generalized time-linkage mechanism that systematically embeds historical solution quality into future problems, thereby capturing critical real-world phenomena such as error accumulation and time-deception. Extensive experimental results validate the effectiveness of the proposed framework, demonstrating its superiority over conventional benchmarks in terms of realism, complexity, and its capability for discriminating state-of-the-art algorithmic performance. This work establishes a new standard for dynamic multi-objective optimization benchmarking, providing a powerful tool for the development and evaluation of next-generation algorithms capable of addressing the complexities of real-world dynamic systems.",
        "authors": "Chang Shao, Qi Zhao, Nana Pu, Shi Cheng, Jing Jiang, Yuhui Shi",
        "url": "http://arxiv.org/abs/2601.01317v1",
        "pdf_url": "https://arxiv.org/pdf/2601.01317v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "综述并提出了一个用于连续动态多目标优化（DMOO）的综合性基准测试框架。",
        "reason_zh": "这篇论文提供了一个关于连续动态多目标优化（DMOO）的全面综述，并提出了一个构建高度真实和挑战性DMOO基准的通用框架。优化是统计学和数据科学的核心基础之一，这篇综述的“综合性”和“原则性框架”使其对于希望深入理解和研究高级优化问题的博士生具有重要的理论和实践指导价值。"
    },
    {
        "id": "http://arxiv.org/abs/2601.01976v1",
        "title": "CNC-TP: Classifier Nominal Concept Based on Top-Pertinent Attributes",
        "summary": "Knowledge Discovery in Databases (KDD) aims to exploit the vast amounts of data generated daily across various domains of computer applications. Its objective is to extract hidden and meaningful knowledge from datasets through a structured process comprising several key steps: data selection, preprocessing, transformation, data mining, and visualization. Among the core data mining techniques are classification and clustering. Classification involves predicting the class of new instances using a classifier trained on labeled data. Several approaches have been proposed in the literature, including Decision Tree Induction, Bayesian classifiers, Nearest Neighbor search, Neural Networks, Support Vector Machines, and Formal Concept Analysis (FCA). The last one is recognized as an effective approach for interpretable and explainable learning. It is grounded in the mathematical structure of the concept lattice, which enables the generation of formal concepts and the discovery of hidden relationships among them. In this paper, we present a state-of-theart review of FCA-based classifiers. We explore various methods for computing closure operators from nominal data and introduce a novel approach for constructing a partial concept lattice that focuses on the most relevant concepts. Experimental results are provided to demonstrate the efficiency of the proposed method.",
        "authors": "Yasmine Souissi, Fabrice Boissier, Nida Meddouri",
        "url": "http://arxiv.org/abs/2601.01976v1",
        "pdf_url": "https://arxiv.org/pdf/2601.01976v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Clarity": 3,
            "Utility": 3
        },
        "core_value_zh": "综述基于形式概念分析（FCA）的分类器，并提出一种新的分类方法。",
        "reason_zh": "这篇论文提供了形式概念分析（FCA）分类器的最新综述。FCA是一种基于格论的数学理论，用于知识发现和数据分析。对于对信息论、离散数学或可解释机器学习理论基础感兴趣的博士生，这篇综述能提供一个严谨的视角来理解基于概念的分类方法，有助于拓宽其数学和理论基础。"
    },
    {
        "id": "http://arxiv.org/abs/2601.04557v1",
        "title": "The explicit constraint force method for optimal experimental design",
        "summary": "The explicit constraint force method (ECFM) was recently introduced as a novel formulation of the physics-informed solution reconstruction problem, and was subsequently extended to inverse problems. In both solution reconstruction and inverse problems, model parameters are estimated with the help of measurement data. In practice, experimentalists seek to design experiments such that the acquired data leads to the most robust recovery of the missing parameters in a subsequent inverse problem. While there are well-established techniques for designing experiments with standard approaches to the inverse problem, optimal experimental design (OED) has yet to be explored with the ECFM formulation. In this work, we investigate OED with a constraint force objective. First, we review traditional approaches to OED based on the Fisher information matrix, and propose an analogous formulation based on constraint forces. Next, we reflect on the different interpretations of the objective from standard and constraint force-based inverse problems. We then test our method on several example problems. These examples suggest that an experiment which is optimal in the sense of constraint forces tends to position measurements in the stiffest regions of the system. Because the responses -- and thus the measurements -- are small in these regions, this strategy is impractical in the presence of measurement noise and/or finite measurement precision. As such, our provisional conclusion is that ECFM is not a viable approach to OED.",
        "authors": "Conor Rowan",
        "url": "http://arxiv.org/abs/2601.04557v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04557v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 2,
            "Rigor": 4,
            "Clarity": 3,
            "Utility": 4
        },
        "core_value_zh": "回顾基于Fisher信息矩阵的传统最优实验设计（OED）方法。",
        "reason_zh": "这篇论文首先“回顾了传统的最优实验设计（OED）方法，特别是基于Fisher信息矩阵的方法”。OED是统计学中的一个核心基础课程主题，而Fisher信息矩阵是高等统计推断中的关键概念。尽管论文后续提出了一个新方法并得出负面结论，但其对传统OED的严谨回顾部分，对于希望补全统计学核心基础知识，尤其是实验设计理论的博士生来说，具有重要的学习价值。"
    }
]