[
    {
        "id": "http://arxiv.org/abs/2602.05665v1",
        "title": "Graph-based Agent Memory: Taxonomy, Techniques, and Applications",
        "summary": "Memory emerges as the core module in the Large Language Model (LLM)-based agents for long-horizon complex tasks (e.g., multi-turn dialogue, game playing, scientific discovery), where memory can enable knowledge accumulation, iterative reasoning and self-evolution. Among diverse paradigms, graph stands out as a powerful structure for agent memory due to the intrinsic capabilities to model relational dependencies, organize hierarchical information, and support efficient retrieval. This survey presents a comprehensive review of agent memory from the graph-based perspective. First, we introduce a taxonomy of agent memory, including short-term vs. long-term memory, knowledge vs. experience memory, non-structural vs. structural memory, with an implementation view of graph-based memory. Second, according to the life cycle of agent memory, we systematically analyze the key techniques in graph-based agent memory, covering memory extraction for transforming the data into the contents, storage for organizing the data efficiently, retrieval for retrieving the relevant contents from memory to support reasoning, and evolution for updating the contents in the memory. Third, we summarize the open-sourced libraries and benchmarks that support the development and evaluation of self-evolving agent memory. We also explore diverse application scenarios. Finally, we identify critical challenges and future research directions. This survey aims to offer actionable insights to advance the development of more efficient and reliable graph-based agent memory systems. All the related resources, including research papers, open-source data, and projects, are collected for the community in https://github.com/DEEP-PolyU/Awesome-GraphMemory.",
        "authors": "Chang Yang, Chuang Zhou, Yilin Xiao, Su Dong, Luyao Zhuang, Yujing Zhang, Zhu Wang, Zijin Hong, Zheng Yuan, Zhishang Xiang, Shengyuan Chen, Huachi Zhou, Qinggang Zhang, Ninghao Liu, Jinsong Su, Xinrun Wang, Yi Chang, Xiao Huang",
        "url": "http://arxiv.org/abs/2602.05665v1",
        "pdf_url": "https://arxiv.org/pdf/2602.05665v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "全面综述了基于图的LLM智能体记忆系统，涵盖其分类、技术和应用，并指明了未来研究方向。",
        "reason_zh": "这篇综述系统地梳理了基于图的记忆范式在LLM智能体中的应用，从记忆的提取、存储、检索到演化全生命周期进行分析，并提供了开源资源。对于理解LLM智能体的核心机制、探索其在长周期复杂任务中的记忆和推理能力，以及指引未来研究方向具有极高的指导价值，尤其符合您对LLM理论机制和AI智能体前沿研究的需求。"
    },
    {
        "id": "http://arxiv.org/abs/2602.04813v1",
        "title": "Agentic AI in Healthcare & Medicine: A Seven-Dimensional Taxonomy for Empirical Evaluation of LLM-based Agents",
        "summary": "Large Language Model (LLM)-based agents that plan, use tools and act has begun to shape healthcare and medicine. Reported studies demonstrate competence on various tasks ranging from EHR analysis and differential diagnosis to treatment planning and research workflows. Yet the literature largely consists of overviews which are either broad surveys or narrow dives into a single capability (e.g., memory, planning, reasoning), leaving healthcare work without a common frame. We address this by reviewing 49 studies using a seven-dimensional taxonomy: Cognitive Capabilities, Knowledge Management, Interaction Patterns, Adaptation & Learning, Safety & Ethics, Framework Typology and Core Tasks & Subtasks with 29 operational sub-dimensions. Using explicit inclusion and exclusion criteria and a labeling rubric (Fully Implemented, Partially Implemented, Not Implemented), we map each study to the taxonomy and report quantitative summaries of capability prevalence and co-occurrence patterns. Our empirical analysis surfaces clear asymmetries. For instance, the External Knowledge Integration sub-dimension under Knowledge Management is commonly realized (~76% Fully Implemented) whereas Event-Triggered Activation sub-dimenison under Interaction Patterns is largely absent (~92% Not Implemented) and Drift Detection & Mitigation sub-dimension under Adaptation & Learning is rare (~98% Not Implemented). Architecturally, Multi-Agent Design sub-dimension under Framework Typology is the dominant pattern (~82% Fully Implemented) while orchestration layers remain mostly partial. Across Core Tasks & Subtasks, information centric capabilities lead e.g., Medical Question Answering & Decision Support and Benchmarking & Simulation, while action and discovery oriented areas such as Treatment Planning & Prescription still show substantial gaps (~59% Not Implemented).",
        "authors": "Shubham Vatsal, Harsh Dubey, Aditi Singh",
        "url": "http://arxiv.org/abs/2602.04813v1",
        "pdf_url": "https://arxiv.org/pdf/2602.04813v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 4
        },
        "core_value_zh": "提出了一个七维分类法，用于实证评估医疗健康领域中基于LLM的智能体，揭示了当前能力的差距和未来发展方向。",
        "reason_zh": "这篇综述为医疗健康领域的LLM智能体提供了急需的、结构化的评估框架。其七维分类法和对49项研究的实证分析，清晰地指出了当前智能体在认知能力、知识管理、安全伦理等方面的实现程度和不足，对指导未来AI智能体在特定高风险领域的理论和应用研究具有重要意义，符合您对LLM理论机制和AI智能体前沿研究的需求。"
    },
    {
        "id": "http://arxiv.org/abs/2602.04518v1",
        "title": "Learning the Value Systems of Agents with Preference-based and Inverse Reinforcement Learning",
        "summary": "Agreement Technologies refer to open computer systems in which autonomous software agents interact with one another, typically on behalf of humans, in order to come to mutually acceptable agreements. With the advance of AI systems in recent years, it has become apparent that such agreements, in order to be acceptable to the involved parties, must remain aligned with ethical principles and moral values. However, this is notoriously difficult to ensure, especially as different human users (and their software agents) may hold different value systems, i.e. they may differently weigh the importance of individual moral values. Furthermore, it is often hard to specify the precise meaning of a value in a particular context in a computational manner. Methods to estimate value systems based on human-engineered specifications, e.g. based on value surveys, are limited in scale due to the need for intense human moderation. In this article, we propose a novel method to automatically \\emph{learn} value systems from observations and human demonstrations. In particular, we propose a formal model of the \\emph{value system learning} problem, its instantiation to sequential decision-making domains based on multi-objective Markov decision processes, as well as tailored preference-based and inverse reinforcement learning algorithms to infer value grounding functions and value systems. The approach is illustrated and evaluated by two simulated use cases.",
        "authors": "Andrés Holgado-Sánchez, Holger Billhardt, Alberto Fernández, Sascha Ossowski",
        "url": "http://arxiv.org/abs/2602.04518v1",
        "pdf_url": "https://arxiv.org/pdf/2602.04518v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "提出了一种基于偏好和逆强化学习的正式方法，用于自动学习智能体的价值系统，以解决AI伦理和对齐问题。",
        "reason_zh": "这篇论文深入探讨了AI伦理和对齐的核心问题——如何让智能体理解和遵循人类的价值系统。它通过形式化的多目标马尔可夫决策过程，结合偏好学习和逆强化学习，提供了一种严谨的理论框架和算法，对于理解LLM对齐的理论基础和未来研究方向非常有启发性，完美契合您对Offline RL和LLM理论机制的需求。"
    },
    {
        "id": "http://arxiv.org/abs/2602.03003v1",
        "title": "Methods and Open Problems in Differentiable Social Choice: Learning Mechanisms, Decisions, and Alignment",
        "summary": "Social choice is no longer a peripheral concern of political theory or economics-it has become a foundational component of modern machine learning systems. From auctions and resource allocation to federated learning, participatory governance, and the alignment of large language models, machine learning pipelines increasingly aggregate heterogeneous preferences, incentives, and judgments into collective decisions. In effect, many contemporary machine learning systems already implement social choice mechanisms, often implicitly and without explicit normative scrutiny.   This Review surveys differentiable social choice: an emerging paradigm that formulates voting rules, mechanisms, and aggregation procedures as learnable, differentiable models optimized from data. We synthesize work across auctions, voting, budgeting, liquid democracy, decentralized aggregation, and inverse mechanism learning, showing how classical axioms and impossibility results reappear as objectives, constraints, and optimization trade-offs. We conclude by identifying 36 open problems defining a new research agenda at the intersection of machine learning, economics, and democratic theory.",
        "authors": "Zhiyu An, Wan Du",
        "url": "http://arxiv.org/abs/2602.03003v1",
        "pdf_url": "https://arxiv.org/pdf/2602.03003v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "综述了可微分社会选择这一新兴范式，将其与机器学习、经济学和民主理论结合，并提出了36个开放性问题，为未来研究指明方向。",
        "reason_zh": "这是一篇极具前瞻性的综述，将社会选择理论与机器学习深度融合，探讨了如何通过可微分模型优化集体决策和AI对齐。其提出的36个开放性问题，对于博士生在高维统计、因果推断（尤其是在多主体决策和对齐方面）以及LLM理论机制等领域寻找创新研究点具有极高的指导价值。"
    },
    {
        "id": "http://arxiv.org/abs/2602.01644v1",
        "title": "From Perception to Action: Spatial AI Agents and World Models",
        "summary": "While large language models have become the prevailing approach for agentic reasoning and planning, their success in symbolic domains does not readily translate to the physical world. Spatial intelligence, the ability to perceive 3D structure, reason about object relationships, and act under physical constraints, is an orthogonal capability that proves important for embodied agents. Existing surveys address either agentic architectures or spatial domains in isolation. None provide a unified framework connecting these complementary capabilities. This paper bridges that gap. Through a thorough review of over 2,000 papers, citing 742 works from top-tier venues, we introduce a unified three-axis taxonomy connecting agentic capabilities with spatial tasks across scales. Crucially, we distinguish spatial grounding (metric understanding of geometry and physics) from symbolic grounding (associating images with text), arguing that perception alone does not confer agency. Our analysis reveals three key findings mapped to these axes: (1) hierarchical memory systems (Capability axis) are important for long-horizon spatial tasks. (2) GNN-LLM integration (Task axis) is a promising approach for structured spatial reasoning. (3) World models (Scale axis) are essential for safe deployment across micro-to-macro spatial scales. We conclude by identifying six grand challenges and outlining directions for future research, including the need for unified evaluation frameworks to standardize cross-domain assessment. This taxonomy provides a foundation for unifying fragmented research efforts and enabling the next generation of spatially-aware autonomous systems in robotics, autonomous vehicles, and geospatial intelligence.",
        "authors": "Gloria Felicia, Nolan Bryant, Handi Putra, Ayaan Gazali, Eliel Lobo, Esteban Rojas",
        "url": "http://arxiv.org/abs/2602.01644v1",
        "pdf_url": "https://arxiv.org/pdf/2602.01644v1",
        "type": "前沿深度",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "提出了一个统一的分类法，连接了空间AI智能体的感知与行动，并探讨了世界模型在具身智能体中的关键作用，指出了六大挑战。",
        "reason_zh": "这篇论文对空间AI智能体和世界模型进行了全面而深入的综述，提出了一个连接感知、推理和行动的统一框架。它强调了GNN-LLM集成和世界模型的重要性，并明确指出了未来的六大研究挑战，对于研究Offline RL、LLM理论机制（尤其是具身智能体）的博士生具有重要的启发和指导意义。"
    },
    {
        "id": "http://arxiv.org/abs/2602.05799v1",
        "title": "Non-Stationary Inventory Control with Lead Times",
        "summary": "We study non-stationary single-item, periodic-review inventory control problems in which the demand distribution is unknown and may change over time. We analyze how demand non-stationarity affects learning performance across inventory models, including systems with demand backlogging or lost-sales, both with and without lead times. For each setting, we propose an adaptive online algorithm that optimizes over the class of base-stock policies and establish performance guarantees in terms of dynamic regret relative to the optimal base-stock policy at each time step. Our results reveal a sharp separation across inventory models. In backlogging systems and lost-sales models with zero lead time, we show that it is possible to adapt to demand changes without incurring additional performance loss in stationary environments, even without prior knowledge of the demand distributions or the number of demand shifts. In contrast, for lost-sales systems with positive lead times, we establish weaker guarantees that reflect fundamental limitations imposed by delayed replenishment in combination with censored feedback. Our algorithms leverage the convexity and one-sided feedback structure of inventory costs to enable counterfactual policy evaluation despite demand censoring. We complement the theoretical analysis with simulation results showing that our methods significantly outperform existing benchmarks.",
        "authors": "Nele H. Amiri, Sean R. Sinclair, Maximiliano Udenio",
        "url": "http://arxiv.org/abs/2602.05799v1",
        "pdf_url": "https://arxiv.org/pdf/2602.05799v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 5
        },
        "core_value_zh": "针对非平稳库存控制问题，提出了自适应在线算法并提供了动态遗憾性能保证，揭示了不同库存模型间的理论差异。",
        "reason_zh": "这篇论文深入探讨了非平稳环境下的在线优化和随机过程问题，通过动态遗憾（dynamic regret）这一严谨的数学工具来衡量算法性能。它利用了成本函数的凸性和单边反馈结构，对于理解和构建具有数学严谨性的自适应决策算法，以及在随机过程和优化领域补全博士基础知识非常有帮助。"
    },
    {
        "id": "http://arxiv.org/abs/2602.02095v1",
        "title": "Convex limiting for finite elements and its relationship to residual distribution",
        "summary": "We review some recent advances in the field of element-based algebraic stabilization for continuous finite element discretizations of nonlinear hyperbolic problems. The main focus is on multidimensional convex limiting techniques designed to constrain antidiffusive element contributions rather than fluxes. We show that the resulting schemes can be interpreted as residual distribution methods. Two kinds of convex limiting can be used to enforce the validity of generalized discrete maximum principles in this context. The first approach has the structure of a localized flux-corrected transport (FCT) algorithm, in which the computation of a low-order predictor is followed by an antidiffusive correction stage. The second option is the use of a monolithic convex limiting (MCL) procedure at the level of spatial semi-discretization. In both cases, inequality constraints are imposed on scalar functions of intermediate states that are required to stay in convex invariant sets.",
        "authors": "Dmitri Kuzmin",
        "url": "http://arxiv.org/abs/2602.02095v1",
        "pdf_url": "https://arxiv.org/pdf/2602.02095v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "综述了有限元方法中的凸限制技术及其与残差分布法的关系，强调了在非线性双曲问题中保持离散最大值原理的数学严谨性。",
        "reason_zh": "这篇综述专注于数值分析中的核心概念——凸限制和有限元方法，尤其是在处理非线性双曲问题时的数学严谨性。它探讨了如何通过凸限制技术来强制满足广义离散最大值原理，这对于理解凸优化在数值方法中的应用、以及高等数学物理方程的数值解法具有重要的理论基础价值。"
    },
    {
        "id": "http://arxiv.org/abs/2602.01420v1",
        "title": "Regret of $H_\\infty$ Preview Controllers",
        "summary": "This paper studies preview control in both the $H_\\infty$ and regret-optimal settings. The plant is modeled as a discrete-time, linear time-invariant system subject to external disturbances. The performance baseline is the optimal non-causal controller that has full knowledge of the disturbance sequence. We first review the construction of the $H_\\infty$ preview controller with $p$-steps of disturbance preview. We then show that the closed-loop $H_\\infty$ performance of this preview controller converges as $p\\to \\infty$ to the performance of the optimal non-causal controller. Furthermore, we prove that the optimal regret of the preview controller converges to zero. These results demonstrate that increasing preview length allows controllers to asymptotically achieve non-causal performance in both the $H_\\infty$ and regret frameworks. A numerical example illustrates the theoretical results.",
        "authors": "Jietian Liu, Peter Seiler",
        "url": "http://arxiv.org/abs/2602.01420v1",
        "pdf_url": "https://arxiv.org/pdf/2602.01420v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 5,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "严谨分析了$H_\\infty$预瞄控制器的遗憾性能，并证明了其渐近收敛到最优非因果控制器的性能。",
        "reason_zh": "这篇论文从理论上深入分析了$H_\\infty$控制和遗憾优化（regret-optimal）这两个在控制理论和在线学习中都非常重要的概念。它通过数学证明揭示了预瞄控制器性能的收敛性，对于理解鲁棒控制、随机过程中的决策理论以及优化算法的理论界限，提供了坚实的数学基础。"
    },
    {
        "id": "http://arxiv.org/abs/2602.01397v1",
        "title": "Nonlinear model reduction for transport-dominated problems",
        "summary": "This article surveys nonlinear model reduction methods that remain effective in regimes where linear reduced-space approximations are intrinsically inefficient, such as transport-dominated problems with wave-like phenomena and moving coherent structures, which are commonly associated with the Kolmogorov barrier. The article organizes nonlinear model reduction techniques around three key elements -- nonlinear parametrizations, reduced dynamics, and online solvers -- and categorizes existing approaches into transformation-based methods, online adaptive techniques, and formulations that combine generic nonlinear parametrizations with instantaneous residual minimization.",
        "authors": "Jan S. Hesthaven, Benjamin Peherstorfer, Benjamin Unger",
        "url": "http://arxiv.org/abs/2602.01397v1",
        "pdf_url": "https://arxiv.org/pdf/2602.01397v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Clarity": 4,
            "Utility": 4
        },
        "core_value_zh": "综述了针对传输主导问题（如波现象和移动相干结构）的非线性模型降阶方法，以克服线性近似的局限性。",
        "reason_zh": "这篇综述聚焦于复杂系统建模中的一个核心挑战——非线性模型降阶，特别是针对传输主导问题。它探讨了如何构建有效的非线性参数化和降阶动力学，以应对“柯尔莫哥洛夫壁垒”等理论难题，对于研究高等数值分析、偏微分方程的近似解法以及高维数据降维的理论基础具有重要价值。"
    },
    {
        "id": "http://arxiv.org/abs/2602.01301v1",
        "title": "A survey of scalar and vector extrapolation",
        "summary": "Scalar extrapolation and convergence acceleration methods are central tools in numerical analysis for improving the efficiency of iterative algorithms and the summation of slowly convergent series. These methods construct transformed sequences that converge more rapidly to the same limit without altering the underlying iterative process, thereby reducing computational cost and enhancing numerical accuracy. Historically, the origins of such techniques can be traced back to classical algebraic methods by AlKhwarizmi and early series acceleration techniques by Newton, while systematic approaches emerged in the 20th century with Aitken process and Richardson extrapolation. Later developments, including the Shanks transformation and Wynn epsilon algorithm, provided general frameworks capable of eliminating multiple dominant error components, with deep connections to Pade approximants and rational approximations of generating functions. This paper presents a comprehensive review of classical scalar extrapolation methods, including Richardson extrapolation, Aitken process, Shanks transformation, Wynn epsilon algorithm, and other algorithms. We examine their theoretical foundations, asymptotic error models, convergence properties, numerical stability, and practical implementation considerations. The second part of this work is dedicated to vector extrapolation methods: polynomial based ones and epsilon algorithm generalizations to vector sequences. Additionally, we highlight modern developments such as their applications to iterative solvers, Krylov subspace methods, and large-scale computational simulations. The aim of this review is to provide a unified perspective on scalar and vector extrapolation techniques, bridging historical origins, theoretical insights, and contemporary computational applications.",
        "authors": "Khalide Jbilou",
        "url": "http://arxiv.org/abs/2602.01301v1",
        "pdf_url": "https://arxiv.org/pdf/2602.01301v1",
        "type": "基础核心",
        "scores": {
            "Novelty": 3,
            "Rigor": 5,
            "Clarity": 5,
            "Utility": 5
        },
        "core_value_zh": "全面综述了数值分析中加速收敛的标量和向量外推方法，涵盖其理论基础、收敛性质和现代应用。",
        "reason_zh": "这是一篇关于数值分析核心工具——外推法（extrapolation）的全面综述。它详细阐述了各种经典方法的理论基础、渐近误差模型和收敛性质，并连接到现代计算应用，对于博士生深入理解迭代算法的加速技巧、数值稳定性以及补全高等数值分析的数学拼图至关重要。"
    }
]