{
    "id": "http://arxiv.org/abs/2511.06745v1",
    "title": "Physically-Grounded Goal Imagination: Physics-Informed Variational Autoencoder for Self-Supervised Reinforcement Learning",
    "summary": "Self-supervised goal-conditioned reinforcement learning enables robots to autonomously acquire diverse skills without human supervision. However, a central challenge is the goal setting problem: robots must propose feasible and diverse goals that are achievable in their current environment. Existing methods like RIG (Visual Reinforcement Learning with Imagined Goals) use variational autoencoder (VAE) to generate goals in a learned latent space but have the limitation of producing physically implausible goals that hinder learning efficiency. We propose Physics-Informed RIG (PI-RIG), which integrates physical constraints directly into the VAE training process through a novel Enhanced Physics-Informed Variational Autoencoder (Enhanced p3-VAE), enabling the generation of physically consistent and achievable goals. Our key innovation is the explicit separation of the latent space into physics variables governing object dynamics and environmental factors capturing visual appearance, while enforcing physical consistency through differential equation constraints and conservation laws. This enables the generation of physically consistent and achievable goals that respect fundamental physical principles such as object permanence, collision constraints, and dynamic feasibility. Through extensive experiments, we demonstrate that this physics-informed goal generation significantly improves the quality of proposed goals, leading to more effective exploration and better skill acquisition in visual robotic manipulation tasks including reaching, pushing, and pick-and-place scenarios.",
    "authors": "Lan Thi Ha Nguyen, Kien Ton Manh, Anh Do Duc, Nam Pham Hai",
    "url": "http://arxiv.org/abs/2511.06745v1",
    "pdf_url": "http://arxiv.org/pdf/2511.06745v1",
    "reason_zh": "这篇论文完全符合您的偏好和任务，因为它提出了一种**创新算法**PI-RIG（Physics-Informed RIG），旨在解决**强化学习实际应用中的核心瓶颈之一：数据效率低下**。具体来说，在自监督目标条件强化学习（self-supervised goal-conditioned RL）中，现有方法（如基于VAE）生成的许多目标是物理上不合理的，导致机器人浪费大量时间尝试学习不可达或无意义的任务，从而严重阻碍了学习效率。PI-RIG通过引入物理信息变分自编码器（Enhanced p3-VAE），将物理约束直接集成到目标生成过程中，确保生成的目标是物理上一致和可实现的。这种方法显著提高了目标质量，促进了更有效的探索和技能获取，尤其在机器人操作任务中，直接解决了因目标不可达性导致的数据浪费和学习效率低的问题，使其更适用于实际部署。",
    "reason_en": "This paper perfectly fits your preference and task because it proposes an **innovative algorithm**, PI-RIG (Physics-Informed RIG), specifically designed to address **one of the core bottlenecks in practical Reinforcement Learning applications: data inefficiency**. In self-supervised goal-conditioned reinforcement learning, existing methods (e.g., VAE-based) often generate physically implausible goals. This leads to agents wasting significant time attempting to learn unattainable or meaningless tasks, severely hindering learning efficiency. PI-RIG tackles this by introducing an Enhanced Physics-Informed Variational Autoencoder (Enhanced p3-VAE) that integrates physical constraints directly into the goal generation process, ensuring the generated goals are physically consistent and achievable. This approach significantly improves goal quality, fostering more effective exploration and skill acquisition, particularly in robotic manipulation tasks. It directly resolves the issue of data wastage and low learning efficiency caused by goal implausibility, making RL more practical for real-world deployment."
}