{
    "id": "http://arxiv.org/abs/2511.06756v1",
    "title": "Dual Mamba for Node-Specific Representation Learning: Tackling Over-Smoothing with Selective State Space Modeling",
    "summary": "Over-smoothing remains a fundamental challenge in deep Graph Neural Networks (GNNs), where repeated message passing causes node representations to become indistinguishable. While existing solutions, such as residual connections and skip layers, alleviate this issue to some extent, they fail to explicitly model how node representations evolve in a node-specific and progressive manner across layers. Moreover, these methods do not take global information into account, which is also crucial for mitigating the over-smoothing problem. To address the aforementioned issues, in this work, we propose a Dual Mamba-enhanced Graph Convolutional Network (DMbaGCN), which is a novel framework that integrates Mamba into GNNs to address over-smoothing from both local and global perspectives. DMbaGCN consists of two modules: the Local State-Evolution Mamba (LSEMba) for local neighborhood aggregation and utilizing Mamba's selective state space modeling to capture node-specific representation dynamics across layers, and the Global Context-Aware Mamba (GCAMba) that leverages Mamba's global attention capabilities to incorporate global context for each node. By combining these components, DMbaGCN enhances node discriminability in deep GNNs, thereby mitigating over-smoothing. Extensive experiments on multiple benchmarks demonstrate the effectiveness and efficiency of our method.",
    "authors": "Xin He, Yili Wang, Yiwei Dai, Xin Wang",
    "url": "http://arxiv.org/abs/2511.06756v1",
    "pdf_url": "http://arxiv.org/pdf/2511.06756v1",
    "reason_zh": "这篇论文完美契合您的偏好。它介绍了一种名为 Dual Mamba-enhanced Graph Convolutional Network (DMbaGCN) 的新型 GNN 架构，通过将 Mamba（一种选择性状态空间模型，近年来备受关注的新型模型）集成到 GNN 中，从局部和全局两个角度解决了深度 GNN 中长期存在的过平滑问题。这种将 Mamba 这种新型序列模型与 GNN 相结合的方法，代表了一种显著的“跨领域模型架构”创新和“结构创新”，它将不同模型范式的优势融合，以解决 GNN 的核心限制，从而在节点表征学习方面实现了“突破性应用”。",
    "reason_en": "This paper perfectly fits your preference. It introduces a novel GNN architecture called Dual Mamba-enhanced Graph Convolutional Network (DMbaGCN), which integrates Mamba (a selective state space model, a novel and highly topical architecture) into GNNs to address the fundamental over-smoothing problem in deep GNNs from both local and global perspectives. This approach, combining a new type of sequential model like Mamba with GNNs, represents a significant 'cross-domain model architecture' innovation and 'structural innovation.' It merges the strengths of different model paradigms to tackle a core limitation of GNNs, leading to a 'breakthrough application' in node representation learning."
}