[
    {
        "id": "http://arxiv.org/abs/2512.19251v1",
        "title": "Institutional Backing and Crypto Volatility: A Hybrid Framework for DeFi Stabilization",
        "summary": "Decentralized finance (DeFi) lacks centralized oversight, often resulting in heightened volatility. In contrast, centralized finance (CeFi) offers a more stable environment with institutional safeguards. Institutional backing can play a stabilizing role in a hybrid structure (HyFi), enhancing transparency, governance, and market discipline. This study investigates whether HyFi-like cryptocurrencies, those backed by institutions, exhibit lower price risk than fully decentralized counterparts. Using daily data for 18 major cryptocurrencies from January 2020 to November 2024, we estimate panel EGLS models with fixed, random, and dynamic specifications. Results show that HyFi-like assets consistently experience lower price risk, with this effect intensifying during periods of elevated market volatility. The negative interaction between HyFi status and market-wide volatility confirms their stabilizing role. Conversely, greater decentralization is strongly associated with increased volatility, particularly during periods of market stress. Robustness checks using quantile regressions and pre-/post-Terra Luna subsamples reinforce these findings, with stronger effects observed in high-volatility quantiles and post-crisis conditions. These results highlight the importance of institutional architecture in enhancing the resilience of digital asset markets.",
        "authors": "Ihlas Sovbetov",
        "url": "http://arxiv.org/abs/2512.19251v1",
        "pdf_url": "https://arxiv.org/pdf/2512.19251v1",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文探讨了机构支持（HyFi-like）与加密货币波动性之间的关系，发现机构支持的加密资产具有较低的价格风险，尤其是在市场波动加剧时。这一发现对于构建加密货币市场的量化因子非常有帮助，特别是可以考虑将“机构支持程度”或“去中心化程度”作为影响波动性的潜在因子，进而用于风险管理或构建低波动策略。论文采用了面板EGLS模型、分位数回归等严谨的统计方法进行实证分析，符合统计学硕士对理论严谨性的偏好，且研究结果具有较强的实践指导意义，可直接启发因子构造和策略设计。"
    }
]