[
    {
        "id": "http://arxiv.org/abs/2511.08571v1",
        "title": "Forecast-to-Fill: Benchmark-Neutral Alpha and Billion-Dollar Capacity in Gold Futures (2015-2025)",
        "summary": "We test whether simple, interpretable state variables-trend and momentum-can generate durable out-of-sample alpha in one of the world's most liquid assets, gold. Using a rolling 10-year training and 6-month testing walk-forward from 2015 to 2025 (2,793 trading days), we convert a smoothed trend-momentum regime signal into volatility-targeted, friction-aware positions through fractional, impact-adjusted Kelly sizing and ATR-based exits. Out of sample, the strategy delivers a Sharpe ratio of 2.88 and a maximum drawdown of 0.52 percent, net of 0.7 basis-point linear cost and a square-root impact term (gamma = 0.02). A regression on spot-gold returns yields a 43 percent annualized return (CAGR approximately 43 percent) and a 37 percent alpha (Sharpe = 2.88, IR = 2.09) at a 15 percent volatility target with beta approximately 0.03, confirming benchmark-neutral performance. Bootstrap confidence intervals ([2.49, 3.27]) and SPA tests (p = 0.000) confirm statistical significance and robustness to latency, reversal, and cost stress. We conclude that forecast-to-fill engineering-linking transparent signals to executable trades with explicit risk, cost, and impact control-can transform modest predictability into allocator-grade, billion-dollar-scalable alpha.",
        "authors": "Mainak Singha, Jose Aguilera-Toste, Vinayak Lahiri",
        "url": "http://arxiv.org/abs/2511.08571v1",
        "pdf_url": null,
        "scores": {
            "Novelty": 2,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文虽然以黄金期货为研究对象，但其提出的方法论对构建加密货币市场的量化因子、进行严格回测和设计交易策略极具参考价值，完全符合您的任务需求。具体而言：\n\n1.  **因子构造与策略设计：** 论文展示了如何将简单的趋势和动量信号转化为具体的交易策略。它强调了“Forecast-to-Fill”的工程思路，即将预测信号与实际交易执行、风险管理（如波动率目标化、ATR止损）和头寸管理（分数Kelly准则）紧密结合。这种将信号转化为可操作策略的系统化方法，对于加密货币因子构造后的策略落地至关重要，提供了可扩展（Billion-Dollar Capacity）的实践指导。\n2.  **严谨的回测：** 采用了极为严谨的“滚动10年训练，6个月测试”的步进式（walk-forward）回测方法，这对于评估因子和策略的样本外表现是黄金标准。更重要的是，论文详细考虑了交易成本（线性成本和平方根冲击项）、滑点、延迟和反转效应，并通过Bootstrap置信区间和SPA测试验证了统计显著性和鲁棒性。这种对回测环节的深度考虑，为在波动性高、交易成本复杂的加密货币市场进行回测树立了典范。\n3.  **理论严谨性与实践影响力：** 论文在数学和统计推导上非常严谨，尤其是在量化交易策略的验证方面，提供了可靠的统计证据。尽管研究对象不是加密货币，但其量化分析框架、成本与冲击建模、以及风险控制机制是跨资产类别通用的，可以直接应用于加密货币市场，帮助您构造出更健壮、更具实战价值的量化因子和交易策略。对于统计学硕士而言，学习这种高度规范和实战化的方法论比单纯学习某个特定加密货币因子更有意义。"
    }
]