[
    {
        "id": "http://arxiv.org/abs/2512.12924v1",
        "title": "Interpretable Hypothesis-Driven Trading:A Rigorous Walk-Forward Validation Framework for Market Microstructure Signals",
        "summary": "We develop a rigorous walk-forward validation framework for algorithmic trading designed to mitigate overfitting and lookahead bias. Our methodology combines interpretable hypothesis-driven signal generation with reinforcement learning and strict out-of-sample testing. The framework enforces strict information set discipline, employs rolling window validation across 34 independent test periods, maintains complete interpretability through natural language hypothesis explanations, and incorporates realistic transaction costs and position constraints. Validating five market microstructure patterns across 100 US equities from 2015 to 2024, the system yields modest annualized returns (0.55%, Sharpe ratio 0.33) with exceptional downside protection (maximum drawdown -2.76%) and market-neutral characteristics (beta = 0.058). Performance exhibits strong regime dependence, generating positive returns during high-volatility periods (0.60% quarterly, 2020-2024) while underperforming in stable markets (-0.16%, 2015-2019). We report statistically insignificant aggregate results (p-value 0.34) to demonstrate a reproducible, honest validation protocol that prioritizes interpretability and extends naturally to advanced hypothesis generators, including large language models. The key empirical finding reveals that daily OHLCV-based microstructure signals require elevated information arrival and trading activity to function effectively. The framework provides complete mathematical specifications and open-source implementation, establishing a template for rigorous trading system evaluation that addresses the reproducibility crisis in quantitative finance research. For researchers, practitioners, and regulators, this work demonstrates that interpretable algorithmic trading strategies can be rigorously validated without sacrificing transparency or regulatory compliance.",
        "authors": "Gagan Deep, Akash Deep, William Lamptey",
        "url": "http://arxiv.org/abs/2512.12924v1",
        "pdf_url": "https://arxiv.org/pdf/2512.12924v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 5,
            "Clarity": 4
        },
        "reason_zh": "这篇论文虽然以美股为研究对象，但其提出的“可解释的假设驱动交易”和“严谨的步进式验证框架”对于加密货币市场的量化因子构造、回测和策略设计具有极高的参考价值。它着重解决了过拟合和未来数据偏差等核心问题，强调了严格的信息集纪律、滚动窗口验证、交易成本和头寸约束，并提供了数学规范和开源实现。这些方法论对于在波动性大、数据特征复杂的加密市场构建鲁棒且可信赖的因子至关重要。其对可解释性和可复现性的重视，也符合统计学硕士对方法严谨性的要求。即使报告了统计不显著的结果，也体现了研究的诚实性和严谨性，这在量化研究中非常宝贵。"
    }
]