[
    {
        "id": "http://arxiv.org/abs/2512.02352v1",
        "title": "Visibility-Graph Asymmetry as a Structural Indicator of Volatility Clustering",
        "summary": "Volatility clustering is one of the most robust stylized facts of financial markets, yet it is typically detected using moment-based diagnostics or parametric models such as GARCH. This paper shows that clustered volatility also leaves a clear imprint on the time-reversal symmetry of horizontal visibility graphs (HVGs) constructed on absolute returns in physical time. For each time point, we compute the maximal forward and backward visibility distances, $L^{+}(t)$ and $L^{-}(t)$, and use their empirical distributions to build a visibility-asymmetry fingerprint comprising the Kolmogorov--Smirnov distance, variance difference, entropy difference, and a ratio of extreme visibility spans. In a Monte Carlo study, these HVG asymmetry features sharply separate volatility-clustered GARCH(1,1) dynamics from i.i.d.\\ Gaussian noise and from randomly shuffled GARCH series that preserve the marginal distribution but destroy temporal dependence; a simple linear classifier based on the fingerprint achieves about 90\\% in-sample accuracy. Applying the method to daily S\\&P500 data reveals a pronounced forward--backward imbalance, including a variance difference $Δ\\mathrm{Var}$ that exceeds the simulated GARCH values by two orders of magnitude and vanishes after shuffling. Overall, the visibility-graph asymmetry fingerprint emerges as a simple, model-free, and geometrically interpretable indicator of volatility clustering and time irreversibility in financial time series.",
        "authors": "Michał Sikorski",
        "url": "http://arxiv.org/abs/2512.02352v1",
        "pdf_url": "https://arxiv.org/pdf/2512.02352v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文提出了一种新颖的、基于可见性图（Visibility Graph）的结构化方法来检测金融时间序列中的波动率聚集和时间不可逆性。对于加密货币市场的量化因子构造，这具有很高的价值：\n1.  **创新性因子来源：** 传统的波动率检测方法通常依赖于GARCH模型或矩分析。该论文提出的“可见性不对称指纹”（包括KS距离、方差差、熵差等）提供了一组全新的、模型无关的特征，可以直接作为加密货币市场的量化因子。\n2.  **适用于加密货币市场：** 加密货币市场以其高波动性、复杂非线性和快速演变著称。这种“模型无关”的方法尤其有吸引力，因为它不需要对数据分布或动态过程做强假设，可能比传统参数模型更具鲁棒性。\n3.  **理论严谨性与可解释性：** 论文通过蒙特卡洛模拟验证了方法的有效性，并将其应用于S&P500数据。可见性图本身具有几何可解释性，这有助于理解因子背后的经济直觉。\n4.  **统计学背景契合：** 作为统计学硕士，论文中涉及的图论、统计距离、熵等概念与您的专业背景高度契合，便于深入理解和应用。\n\n这些因子可以用于构建波动率预测模型、市场状态识别（如高波动率或低波动率时期）、甚至作为交易策略的信号。因此，它对因子构造和策略设计非常有帮助。"
    }
]