[
    {
        "id": "http://arxiv.org/abs/2601.19504v1",
        "title": "Generating Alpha: A Hybrid AI-Driven Trading System Integrating Technical Analysis, Machine Learning and Financial Sentiment for Regime-Adaptive Equity Strategies",
        "summary": "The intricate behavior patterns of financial markets are influenced by fundamental, technical, and psychological factors. During times of high volatility and regime shifts causes many traditional strategies like trend-following or mean-reversion to fail. This paper proposes a hybrid AI-based trading strategy that combines (1) trend-following and directional momentum capture via EMA and MACD, (2) detection of price normalization through mean-reversion using RSI and Bollinger Bands, (3) market psychological interpretation through sentiment analysis using FinBERT, (4) signal generation through machine learning using XGBoost and (5)dynamically adjusting exposure with market regime filtering based on volatility and return environments. The system achieved a final portfolio value of $235,492.83, yielding a return of 135.49% on initial investment over a period of 24 months. The hybrid model outperformed major benchmark indexes like S&P 500 and NASDAQ-100 over the same period showing strong flexibility and lower downside risk with superior profits validating the use of multi-modal AI in algorithmic trading.",
        "authors": "Varun Narayan Kannan Pillai, Akshay Ajith, Sumesh K J",
        "url": "http://arxiv.org/abs/2601.19504v1",
        "pdf_url": "https://arxiv.org/pdf/2601.19504v1",
        "scores": {
            "Novelty": 3,
            "Rigor": 3,
            "Impact": 2,
            "Clarity": 4
        },
        "reason_zh": "这篇论文提出了一个结合技术分析、机器学习（XGBoost）、金融情感分析（FinBERT）和市场状态过滤的混合AI交易系统。其方法论，如多模态数据整合、机器学习信号生成和市场状态适应性策略，对于构建量化因子和设计交易策略具有通用参考价值。然而，该论文的实证研究和成果是针对**股票市场**（S&P 500和NASDAQ-100），而非加密货币市场。虽然技术思路可迁移，但它没有直接提供加密货币市场特有的因子洞察或解决其独特挑战。对于统计学硕士而言，摘要中未深入阐述新颖的统计推导或理论严谨性，更多侧重于系统集成和实证表现。因此，其对您当前任务（加密货币市场的量化因子构造）的直接影响力有所降低，需要自行进行领域适配。"
    }
]