{
    "id": "http://arxiv.org/abs/2511.06634v1",
    "title": "CaberNet: Causal Representation Learning for Cross-Domain HVAC Energy Prediction",
    "summary": "Cross-domain HVAC energy prediction is essential for scalable building energy management, particularly because collecting extensive labeled data for every new building is both costly and impractical. Yet, this task remains highly challenging due to the scarcity and heterogeneity of data across different buildings, climate zones, and seasonal patterns. In particular, buildings situated in distinct climatic regions introduce variability that often leads existing methods to overfit to spurious correlations, rely heavily on expert intervention, or compromise on data diversity. To address these limitations, we propose CaberNet, a causal and interpretable deep sequence model that learns invariant (Markov blanket) representations for robust cross-domain prediction. In a purely data-driven fashion and without requiring any prior knowledge, CaberNet integrates i) a global feature gate trained with a self-supervised Bernoulli regularization to distinguish superior causal features from inferior ones, and ii) a domain-wise training scheme that balances domain contributions, minimizes cross-domain loss variance, and promotes latent factor independence. We evaluate CaberNet on real-world datasets collected from three buildings located in three climatically diverse cities, and it consistently outperforms all baselines, achieving a 22.9\\% reduction in normalized mean squared error (NMSE) compared to the best benchmark. Our code is available at https://github.com/rickzky1001/CaberNet-CRL.",
    "authors": "Kaiyuan Zhai, Jiacheng Cui, Zhehao Zhang, Junyu Xue, Yang Deng, Kui Wu, Guoming Tang",
    "url": "http://arxiv.org/abs/2511.06634v1",
    "pdf_url": "http://arxiv.org/pdf/2511.06634v1",
    "reason_zh": "这篇论文《CaberNet: Causal Representation Learning for Cross-Domain HVAC Energy Prediction》完美符合您的偏好和任务。它专注于构建具有统计意义的高质量特征，其核心在于“因果表示学习”（Causal Representation Learning）。论文明确提出目标是学习“不变的（Markov blanket）表示”，这些表示能够实现“鲁棒的跨域预测”，并且能够“区分出优秀的因果特征与劣质特征”，同时促进“潜在因子独立性”。对于统计学硕士而言，因果推理是构建真正具有统计意义、而非仅仅是表面相关性特征的关键。论文通过理论上扎实的因果框架（例如，Markov blanket），解释了为什么所构建的特征能够提高效果：它们捕捉了数据中不变的、因果相关的结构，从而在面对不同领域（跨域）的异质性时，依然能够保持其统计上的显著性和预测的鲁棒性。这种方法论远超纯粹的工程技巧，提供了深刻的统计学理论支撑。",
    "reason_en": "This paper, \"CaberNet: Causal Representation Learning for Cross-Domain HVAC Energy Prediction,\" perfectly aligns with your preferences and task. It focuses on constructing statistically significant high-quality features, with its core being Causal Representation Learning. The paper explicitly states its goal is to learn \"invariant (Markov blanket) representations\" for \"robust cross-domain prediction,\" capable of \"distinguishing superior causal features from inferior ones,\" while promoting \"latent factor independence.\" For a statistics master's student, causal inference is key to building features that are truly statistically meaningful, rather than merely correlational. The paper provides a theoretically sound causal framework (e.g., Markov blanket) to explain why its proposed features improve performance: they capture invariant, causally-related structures in the data, thereby maintaining their statistical significance and predictive robustness even when confronted with cross-domain heterogeneity. This methodology goes far beyond pure engineering tricks, offering deep statistical theoretical support."
}