[
    {
        "id": "http://arxiv.org/abs/2511.13608v1",
        "title": "A Gentle Introduction to Conformal Time Series Forecasting",
        "summary": "Conformal prediction is a powerful post-hoc framework for uncertainty quantification that provides distribution-free coverage guarantees. However, these guarantees crucially rely on the assumption of exchangeability. This assumption is fundamentally violated in time series data, where temporal dependence and distributional shifts are pervasive. As a result, classical split-conformal methods may yield prediction intervals that fail to maintain nominal validity. This review unifies recent advances in conformal forecasting methods specifically designed to address nonexchangeable data. We first present a theoretical foundation, deriving finite-sample guarantees for split-conformal prediction under mild weak-dependence conditions. We then survey and classify state-of-the-art approaches that mitigate serial dependence by reweighting calibration data, dynamically updating residual distributions, or adaptively tuning target coverage levels in real time. Finally, we present a comprehensive simulation study that compares these techniques in terms of empirical coverage, interval width, and computational cost, highlighting practical trade-offs and open research directions.",
        "authors": "M. Stocker, W. Małgorzewicz, M. Fontana, S. Ben Taieb",
        "url": "http://arxiv.org/abs/2511.13608v1",
        "pdf_url": "https://arxiv.org/pdf/2511.13608v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 5
        },
        "reason_zh": "这篇论文直接解决了时间序列预测中的不确定性量化这一核心统计学挑战。它提出了在弱依赖条件下进行分裂保形预测的有限样本保证，并统一了处理非交换数据的最新方法。其强调“分布自由覆盖率保证”、“有限样本保证”和“弱依赖条件”完全符合您对严格统计保证和清晰数学推导的需求。高清晰度评分也确保了理论的易读性。"
    },
    {
        "id": "http://arxiv.org/abs/2511.13559v1",
        "title": "Asymptotic analysis of rare events in high dimensions",
        "summary": "Understanding rare events is critical across domains ranging from signal processing to reliability and structural safety, extreme-weather forecasting, and insurance. The analysis of rare events is a computationally challenging problem, particularly in high dimensions $d$. In this work, we develop the first asymptotic high-dimensional theory of rare events. First, we exploit asymptotic integral methods recently developed by the first author to provide an asymptotic expansion of rare event probabilities. The expansion employs the geometry of the rare event boundary and the local behavior of the log probability density. Generically, the expansion is valid if $d^2\\llλ$, where $λ$ characterizes the extremity of the event. We prove this condition is necessary by constructing an example in which the first-order remainder is bounded above and below by $d^2/λ$. We also provide a nonasymptotic remainder bound which specifies the precise dependence of the remainder on $d$, $λ$, the density, and the boundary, and which shows that in certain cases, the condition $d^2\\ll λ$ can be relaxed. As an application of the theory, we derive asymptotic approximations to rare probabilities under the standard Gaussian density in high dimensions. In the second part of our work, we provide an asymptotic approximation to densities conditional on rare events. This gives rise to simple procedure for approximately sampling conditionally on the rare event using independent Gaussian and exponential random variables.",
        "authors": "Anya Katsevich, Alexander Katsevich",
        "url": "http://arxiv.org/abs/2511.13559v1",
        "pdf_url": "https://arxiv.org/pdf/2511.13559v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文首次提出了高维稀有事件的渐近理论，包括稀有事件概率的渐近展开式，并给出了指定依赖于维度和事件极端性的非渐近余项界限。其明确的“渐近理论”、“渐近展开”、“非渐近余项界限”以及对必要条件的证明，展现了极强的数学和概率论严谨性，是统计学基础理论的优秀贡献。"
    },
    {
        "id": "http://arxiv.org/abs/2511.13514v1",
        "title": "A Quantum Tensor Network-Based Viewpoint for Modeling and Analysis of Time Series Data",
        "summary": "Accurate uncertainty quantification is a critical challenge in machine learning. While neural networks are highly versatile and capable of learning complex patterns, they often lack interpretability due to their ``black box'' nature. On the other hand, probabilistic ``white box'' models, though interpretable, often suffer from a significant performance gap when compared to neural networks. To address this, we propose a novel quantum physics-based ``white box'' method that offers both accurate uncertainty quantification and enhanced interpretability. By mapping the kernel mean embedding (KME) of a time series data vector to a reproducing kernel Hilbert space (RKHS), we construct a tensor network-inspired 1D spin chain Hamiltonian, with the KME as one of its eigen-functions or eigen-modes. We then solve the associated Schr{ö}dinger equation and apply perturbation theory to quantify uncertainty, thereby improving the interpretability of tasks performed with the quantum tensor network-based model. We demonstrate the effectiveness of this methodology, compared to state-of-the-art ``white box\" models, in change point detection and time series clustering, providing insights into the uncertainties associated with decision-making throughout the process.",
        "authors": "Pragatheeswaran Vipulananthan, Kamal Premaratne, Dilip Sarkar, Manohar N. Murthi",
        "url": "http://arxiv.org/abs/2511.13514v1",
        "pdf_url": "https://arxiv.org/pdf/2511.13514v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文提出了一个基于量子张量网络的“白盒”方法，用于时间序列数据建模和分析，以实现准确的不确定性量化和增强可解释性。它将核平均嵌入映射到再生核希尔伯特空间，构建张量网络启发的哈密顿量，并通过求解薛定谔方程和应用微扰理论来量化不确定性。这结合了量子物理、高级数学（RKHS、微扰理论）和统计学（不确定性量化），具有非常强大的理论基础和数学严谨性。"
    },
    {
        "id": "http://arxiv.org/abs/2511.13229v1",
        "title": "Laplace Learning in Wasserstein Space",
        "summary": "The manifold hypothesis posits that high-dimensional data typically resides on low-dimensional sub spaces. In this paper, we assume manifold hypothesis to investigate graph-based semi-supervised learning   methods. In particular, we examine Laplace Learning in the Wasserstein space, extending the classical   notion of graph-based semi-supervised learning algorithms from finite-dimensional Euclidean spaces to   an infinite-dimensional setting. To achieve this, we prove variational convergence of a discrete graph p- Dirichlet energy to its continuum counterpart. In addition, we characterize the Laplace-Beltrami operator   on asubmanifold of the Wasserstein space. Finally, we validate the proposed theoretical framework through   numerical experiments conducted on benchmark datasets, demonstrating the consistency of our classification performance in high-dimensional settings.",
        "authors": "Mary Chriselda Antony Oliver, Michael Roberts, Carola-Bibiane Schönlieb, Matthew Thorpe",
        "url": "http://arxiv.org/abs/2511.13229v1",
        "pdf_url": "https://arxiv.org/pdf/2511.13229v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 3,
            "Clarity": 4
        },
        "reason_zh": "这篇论文将图基半监督学习中的Laplace Learning扩展到Wasserstein空间这一无限维设置，并通过证明离散图p-Dirichlet能量的变分收敛性及其连续对应，以及刻画Wasserstein空间子流形上的Laplace-Beltrami算子，展现了极高的数学严谨性。这是对机器学习核心概念在高级数学空间中的基础性理论扩展。"
    },
    {
        "id": "http://arxiv.org/abs/2511.13701v1",
        "title": "Learning stochasticity: a nonparametric framework for intrinsic noise estimation",
        "summary": "Understanding the principles that govern dynamical systems is a central challenge across many scientific domains, including biology and ecology. Incomplete knowledge of nonlinear interactions and stochastic effects often renders bottom-up modeling approaches ineffective, motivating the development of methods that can discover governing equations directly from data. In such contexts, parametric models often struggle without strong prior knowledge, especially when estimating intrinsic noise. Nonetheless, incorporating stochastic effects is often essential for understanding the dynamic behavior of complex systems such as gene regulatory networks and signaling pathways. To address these challenges, we introduce Trine (Three-phase Regression for INtrinsic noisE), a nonparametric, kernel-based framework that infers state-dependent intrinsic noise from time-series data. Trine features a three-stage algorithm that com- bines analytically solvable subproblems with a structured kernel architecture that captures both abrupt noise-driven fluctuations and smooth, state-dependent changes in variance. We validate Trine on biological and ecological systems, demonstrating its ability to uncover hidden dynamics without relying on predefined parametric assumptions. Across several benchmark problems, Trine achieves performance comparable to that of an oracle. Biologically, this oracle can be viewed as an idealized observer capable of directly tracking the random fluctuations in molecular concentrations or reaction events within a cell. The Trine framework thus opens new avenues for understanding how intrinsic noise affects the behavior of complex systems.",
        "authors": "Gianluigi Pillonetto, Alberto Giaretta, Mauro Bisiacco",
        "url": "http://arxiv.org/abs/2511.13701v1",
        "pdf_url": "https://arxiv.org/pdf/2511.13701v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文引入了Trine，一个无参数、基于核的框架，用于从时间序列数据中推断状态相关的内在噪声。它采用三阶段算法，结合了可解析的子问题和结构化的核架构。其强调“无参数”、“基于核的框架”、“解析可解子问题”和与“预言机（oracle）”性能的比较，均指向了深厚的统计学和数学严谨性，非常符合您对理论基础的偏好。"
    }
]