[
    {
        "id": "http://arxiv.org/abs/2512.24767v1",
        "title": "From Trial to Deployment: A SEM Analysis of Traveler Adoptions to Fully Operational Autonomous Taxis",
        "summary": "Autonomous taxi services represent a transformative advancement in urban mobility, offering safety, efficiency, and round-the-clock operations. While existing literature has explored user acceptance of autonomous taxis through stated preference experiments and hypothetical scenarios, few studies have investigated actual user behavior based on operational AV services. This study addresses that gap by leveraging survey data from Wuhan, China, where Baidu's Apollo Robotaxi service operates at scale. We design a realistic survey incorporating actual service attributes and collect 336 valid responses from actual users. Using Structural Equation Modeling, we identify six latent psychological constructs, namely Trust \\& Policy Support, Cost Sensitivity, Performance, Behavioral Intention, Lifestyle, and Education. Their influences on adoption behavior, measured by the selection frequency of autonomous taxis in ten scenarios, are examined and interpreted. Results show that Cost Sensitivity and Behavioral Intention are the strongest positive predictors of adoption, while other latent constructs play more nuanced roles. The model demonstrates strong goodness-of-fit across multiple indices. Our findings offer empirical evidence to support policymaking, fare design, and public outreach strategies for scaling autonomous taxis deployments in real-world urban settings.",
        "authors": "Yutong Cai, Hua Wang",
        "url": "http://arxiv.org/abs/2512.24767v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24767v1",
        "scores": {
            "Novelty": 2,
            "Rigor": 2,
            "Impact": 3,
            "Clarity": 4
        },
        "reason_zh": "该论文主要通过结构方程模型（SEM）分析了自动驾驶出租车在实际运营中的用户采纳行为。虽然SEM是一种统计方法，但论文的重点在于社会科学领域的实证研究和行为分析，而非统计学或AI系统本身的理论创新或数学推导。对于追求强大理论基础和数学严谨性的统计学博士生而言，其核心贡献与偏好不符。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24628v1",
        "title": "AI-Driven Acoustic Voice Biomarker-Based Hierarchical Classification of Benign Laryngeal Voice Disorders from Sustained Vowels",
        "summary": "Benign laryngeal voice disorders affect nearly one in five individuals and often manifest as dysphonia, while also serving as non-invasive indicators of broader physiological dysfunction. We introduce a clinically inspired hierarchical machine learning framework for automated classification of eight benign voice disorders alongside healthy controls, using acoustic features extracted from short, sustained vowel phonations. Experiments utilized 15,132 recordings from 1,261 speakers in the Saarbruecken Voice Database, covering vowels /a/, /i/, and /u/ at neutral, high, low, and gliding pitches. Mirroring clinical triage workflows, the framework operates in three sequential stages: Stage 1 performs binary screening of pathological versus non-pathological voices by integrating convolutional neural network-derived mel-spectrogram features with 21 interpretable acoustic biomarkers; Stage 2 stratifies voices into Healthy, Functional or Psychogenic, and Structural or Inflammatory groups using a cubic support vector machine; Stage 3 achieves fine-grained classification by incorporating probabilistic outputs from prior stages, improving discrimination of structural and inflammatory disorders relative to functional conditions. The proposed system consistently outperformed flat multi-class classifiers and pre-trained self-supervised models, including META HuBERT and Google HeAR, whose generic objectives are not optimized for sustained clinical phonation. By combining deep spectral representations with interpretable acoustic features, the framework enhances transparency and clinical alignment. These results highlight the potential of quantitative voice biomarkers as scalable, non-invasive tools for early screening, diagnostic triage, and longitudinal monitoring of vocal health.",
        "authors": "Mohsen Annabestani, Samira Aghadoost, Anais Rameau, Olivier Elemento, Gloria Chia-Yi Chiang",
        "url": "http://arxiv.org/abs/2512.24628v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24628v1",
        "scores": {
            "Novelty": 3,
            "Rigor": 2,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文提出了一个用于语音障碍分类的AI驱动分层机器学习框架。它结合了CNN提取的梅尔频谱特征和可解释的声学生物标记。尽管在临床应用上具有高影响力，但其主要贡献在于系统设计和经验性能，而非机器学习模型本身的新颖理论、数学推导或统计保证。因此，理论严谨性得分较低，与您的偏好不太契合。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24980v1",
        "title": "A Modal Logic for Possibilistic Reasoning with Fuzzy Formal Contexts",
        "summary": "We introduce a two-sort weighted modal logic for possibilistic reasoning with fuzzy formal contexts. The syntax of the logic includes two types of weighted modal operators corresponding to classical necessity ($\\Box$) and sufficiency ($\\boxminus$) modalities and its formulas are interpreted in fuzzy formal contexts based on possibility theory. We present its axiomatization that is \\emph{sound} with respect to the class of all fuzzy context models. In addition, both the necessity and sufficiency fragments of the logic are also individually complete with respect to the class of all fuzzy context models. We highlight the expressive power of the logic with some illustrative examples. As a formal context is the basic construct of formal concept analysis (FCA), we generalize three main notions in FCA, i.e., formal concepts, object oriented concepts, and property oriented concepts, to their corresponding $c$-cut concepts in fuzzy formal contexts. Then, we show that our logical language can represent all three of these generalized notions. Finally, we demonstrate the possibility of extending our logic to reasoning with multi-relational fuzzy contexts, in which the Boolean combinations of different fuzzy relations are allowed.",
        "authors": "Prosenjit Howlader, Churn-Jung Liau",
        "url": "http://arxiv.org/abs/2512.24980v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24980v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 2,
            "Clarity": 4
        },
        "reason_zh": "这篇论文引入了一种新的双类型加权模态逻辑，用于模糊形式背景下的可能性推理。它提出了公理化，并证明了其相对于所有模糊上下文模型的完备性。这直接符合您对“严谨的数学逻辑”和“强大的理论基础”（如因果逻辑、公理化）的偏好，具有极高的理论严谨性。虽然实践影响力可能不如其他AI应用论文，但其在形式逻辑和推理方面的深度是您会欣赏的。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24917v1",
        "title": "Frequent subgraph-based persistent homology for graph classification",
        "summary": "Persistent homology (PH) has recently emerged as a powerful tool for extracting topological features. Integrating PH into machine learning and deep learning models enhances topology awareness and interpretability. However, most PH methods on graphs rely on a limited set of filtrations, such as degree-based or weight-based filtrations, which overlook richer features like recurring information across the dataset and thus restrict expressive power. In this work, we propose a novel graph filtration called Frequent Subgraph Filtration (FSF), which is derived from frequent subgraphs and produces stable and information-rich frequency-based persistent homology (FPH) features. We study the theoretical properties of FSF and provide both proofs and experimental validation. Beyond persistent homology itself, we introduce two approaches for graph classification: an FPH-based machine learning model (FPH-ML) and a hybrid framework that integrates FPH with graph neural networks (FPH-GNNs) to enhance topology-aware graph representation learning. Our frameworks bridge frequent subgraph mining and topological data analysis, offering a new perspective on topology-aware feature extraction. Experimental results show that FPH-ML achieves competitive or superior accuracy compared with kernel-based and degree-based filtration methods. When integrated into graph neural networks, FPH yields relative performance gains ranging from 0.4 to 21 percent, with improvements of up to 8.2 percentage points over GCN and GIN backbones across benchmarks.",
        "authors": "Xinyang Chen, Amaël Broustet, Guoting Chen",
        "url": "http://arxiv.org/abs/2512.24917v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24917v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Impact": 3,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了一种基于频繁子图的新型图过滤方法（FSF），用于图分类的持久同调（Persistent Homology）。它明确研究了FSF的理论性质并提供了证明，这与您对“强大的理论基础”和“清晰的数学推导”的偏好高度一致。它将频繁子图挖掘与拓扑数据分析相结合，为图表示学习提供了新的视角，具有良好的创新性和严谨性。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24901v1",
        "title": "Spectral Graph Neural Networks for Cognitive Task Classification in fMRI Connectomes",
        "summary": "Cognitive task classification using machine learning plays a central role in decoding brain states from neuroimaging data. By integrating machine learning with brain network analysis, complex connectivity patterns can be extracted from functional magnetic resonance imaging connectomes. This process transforms raw blood-oxygen-level-dependent (BOLD) signals into interpretable representations of cognitive processes. Graph neural networks (GNNs) further advance this paradigm by modeling brain regions as nodes and functional connections as edges, capturing topological dependencies and multi-scale interactions that are often missed by conventional approaches. Our proposed SpectralBrainGNN model, a spectral convolution framework based on graph Fourier transforms (GFT) computed via normalized Laplacian eigendecomposition. Experiments on the Human Connectome Project-Task (HCPTask) dataset demonstrate the effectiveness of the proposed approach, achieving a classification accuracy of 96.25\\%. The implementation is publicly available at https://github.com/gnnplayground/SpectralBrainGNN to support reproducibility and future research.",
        "authors": "Debasis Maji, Arghya Banerjee, Debaditya Barman",
        "url": "http://arxiv.org/abs/2512.24901v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24901v1",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Impact": 3,
            "Clarity": 4
        },
        "reason_zh": "这篇论文将谱图神经网络应用于fMRI连接组的认知任务分类。其核心在于利用图傅里叶变换和归一化拉普拉斯特征分解构建谱卷积框架。这体现了将严谨的谱图理论应用于现代AI系统（GNNs）的数学逻辑，符合您对理论基础的要求。虽然模型本身可能不是全新的，但其数学工具的严谨性是值得关注的。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24847v1",
        "title": "AODDiff: Probabilistic Reconstruction of Aerosol Optical Depth via Diffusion-based Bayesian Inference",
        "summary": "High-quality reconstruction of Aerosol Optical Depth (AOD) fields is critical for Atmosphere monitoring, yet current models remain constrained by the scarcity of complete training data and a lack of uncertainty quantification.To address these limitations, we propose AODDiff, a probabilistic reconstruction framework based on diffusion-based Bayesian inference. By leveraging the learned spatiotemporal probability distribution of the AOD field as a generative prior, this framework can be flexibly adapted to various reconstruction tasks without requiring task-specific retraining. We first introduce a corruption-aware training strategy to learns a spatiotemporal AOD prior solely from naturally incomplete data. Subsequently, we employ a decoupled annealing posterior sampling strategy that enables the more effective and integration of heterogeneous observations as constraints to guide the generation process. We validate the proposed framework through extensive experiments on Reanalysis data. Results across downscaling and inpainting tasks confirm the efficacy and robustness of AODDiff, specifically demonstrating its advantage in maintaining high spatial spectral fidelity. Furthermore, as a generative model, AODDiff inherently enables uncertainty quantification via multiple sampling, offering critical confidence metrics for downstream applications.",
        "authors": "Linhao Fan, Hongqiang Fang, Jingyang Dai, Yong Jiang, Qixing Zhang",
        "url": "http://arxiv.org/abs/2512.24847v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24847v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "AODDiff提出了一种基于扩散模型的贝叶斯推理框架，用于气溶胶光学深度（AOD）场的概率重建。它强调了不确定性量化，并利用学习到的时空概率分布作为生成先验。这篇论文结合了贝叶斯推理和扩散模型，具有强大的概率建模和不确定性量化能力，非常符合您对“统计保证”和“理论基础”的偏好。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24834v1",
        "title": "GenZ: Foundational models as latent variable generators within traditional statistical models",
        "summary": "We present GenZ, a hybrid model that bridges foundational models and statistical modeling through interpretable semantic features. While large language models possess broad domain knowledge, they often fail to capture dataset-specific patterns critical for prediction tasks. Our approach addresses this by discovering semantic feature descriptions through an iterative process that contrasts groups of items identified via statistical modeling errors, rather than relying solely on the foundational model's domain understanding. We formulate this as a generalized EM algorithm that jointly optimizes semantic feature descriptors and statistical model parameters. The method prompts a frozen foundational model to classify items based on discovered features, treating these judgments as noisy observations of latent binary features that predict real-valued targets through learned statistical relationships. We demonstrate the approach on two domains: house price prediction (hedonic regression) and cold-start collaborative filtering for movie recommendations. On house prices, our model achieves 12\\% median relative error using discovered semantic features from multimodal listing data, substantially outperforming a GPT-5 baseline (38\\% error) that relies on the LLM's general domain knowledge. For Netflix movie embeddings, our model predicts collaborative filtering representations with 0.59 cosine similarity purely from semantic descriptions -- matching the performance that would require approximately 4000 user ratings through traditional collaborative filtering. The discovered features reveal dataset-specific patterns (e.g., architectural details predicting local housing markets, franchise membership predicting user preferences) that diverge from the model's domain knowledge alone.",
        "authors": "Marko Jojic, Nebojsa Jojic",
        "url": "http://arxiv.org/abs/2512.24834v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24834v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "GenZ提出了一种混合模型，将基础模型（如LLM）作为传统统计模型中的潜在变量生成器。它通过广义EM算法共同优化语义特征描述符和统计模型参数，并将LLM的判断视为潜在二元特征的噪声观测。这种将LLM与严谨统计模型（如EM算法、回归）相结合的方式，具有极高的理论严谨性和数学推导深度，完美契合您对“强大的理论基础”和“清晰的数学推导”的偏好。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24780v1",
        "title": "Gradient Descent as Implicit EM in Distance-Based Neural Models",
        "summary": "Neural networks trained with standard objectives exhibit behaviors characteristic of probabilistic inference: soft clustering, prototype specialization, and Bayesian uncertainty tracking. These phenomena appear across architectures -- in attention mechanisms, classification heads, and energy-based models -- yet existing explanations rely on loose analogies to mixture models or post-hoc architectural interpretation. We provide a direct derivation. For any objective with log-sum-exp structure over distances or energies, the gradient with respect to each distance is exactly the negative posterior responsibility of the corresponding component: $\\partial L / \\partial d_j = -r_j$. This is an algebraic identity, not an approximation. The immediate consequence is that gradient descent on such objectives performs expectation-maximization implicitly -- responsibilities are not auxiliary variables to be computed but gradients to be applied. No explicit inference algorithm is required because inference is embedded in optimization. This result unifies three regimes of learning under a single mechanism: unsupervised mixture modeling, where responsibilities are fully latent; attention, where responsibilities are conditioned on queries; and cross-entropy classification, where supervision clamps responsibilities to targets. The Bayesian structure recently observed in trained transformers is not an emergent property but a necessary consequence of the objective geometry. Optimization and inference are the same process.",
        "authors": "Alan Oursland",
        "url": "http://arxiv.org/abs/2512.24780v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24780v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文提出了一个深刻的理论洞察：在距离或能量的log-sum-exp结构目标函数下，梯度下降本质上是隐式EM算法。它声称这是一个“代数恒等式，而非近似”。这种直接的数学推导揭示了优化与概率推断之间的根本联系，统一了多种学习范式。其创新性和理论严谨性都达到了最高水平，是您作为统计学博士生必读的论文。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24754v1",
        "title": "AstroReview: An LLM-driven Multi-Agent Framework for Telescope Proposal Peer Review and Refinement",
        "summary": "Competitive access to modern observatories has intensified as proposal volumes outpace available telescope time, making timely, consistent, and transparent peer review a critical bottleneck for the advancement of astronomy. Automating parts of this process is therefore both scientifically significant and operationally necessary to ensure fair allocation and reproducible decisions at scale. We present AstroReview, an open-source, agent-based framework that automates proposal review in three stages: (i) novelty and scientific merit, (ii) feasibility and expected yield, and (iii) meta-review and reliability verification. Task isolation and explicit reasoning traces curb hallucinations and improve transparency. Without any domain specific fine tuning, AstroReview used in our experiments only for the last stage, correctly identifies genuinely accepted proposals with an accuracy of 87%. The AstroReview in Action module replicates the review and refinement loop; with its integrated Proposal Authoring Agent, the acceptance rate of revised drafts increases by 66% after two iterations, showing that iterative feedback combined with automated meta-review and reliability verification delivers measurable quality gains. Together, these results point to a practical path toward scalable, auditable, and higher throughput proposal review for resource limited facilities.",
        "authors": "Yutong Wang, Yunxiang Xiao, Yonglin Tian, Junyong Li, Jing Wang, Yisheng Lv",
        "url": "http://arxiv.org/abs/2512.24754v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24754v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文通过多目标优化框架（NSGA-II）来解决保险定价中的公平性问题，同时优化准确性、群体公平性、个体公平性和反事实公平性。这种方法论涉及严谨的优化理论和多维度的统计公平性考量，生成帕累托前沿以平衡不同目标。它展现了在AI系统中应用严谨数学优化和统计公平性理论的能力，符合您的偏好。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24643v1",
        "title": "A Scalable Framework for logP Prediction: From Terabyte-Scale Data Integration to Interpretable Ensemble Modeling",
        "summary": "This study presents a large-scale predictive modeling framework for logP prediction using 426850 bioactive compounds rigorously curated from the intersection of three authoritative chemical databases: PubChem, ChEMBL, and eMolecules. We developed a novel computational infrastructure to address the data integration challenge, reducing processing time from a projected over 100 days to 3.2 hours through byte-offset indexing architecture, a 740-fold improvement. Our comprehensive analysis revealed critical insights into the multivariate nature of lipophilicity: while molecular weight exhibited weak bivariate correlation with logP, SHAP analysis on ensemble models identified it as the single most important predictor globally. We systematically evaluated multiple modeling approaches, discovering that linear models suffered from inherent heteroskedasticity that classical remediation strategies, including weighted least squares and Box-Cox transformation, failed to address. Tree-based ensemble methods, including Random Forest and XGBoost, proved inherently robust to this violation, achieving an R-squared of 0.765 and RMSE of 0.731 logP units on the test set. Furthermore, a stratified modeling strategy, employing specialized models for drug-like molecules (91 percent of dataset) and extreme cases (nine percent), achieved optimal performance: an RMSE of 0.838 for the drug-like subset and an R-squared of 0.767 for extreme molecules, the highest of all evaluated approaches. These findings provide actionable guidance for molecular design, establish robust baselines for lipophilicity prediction using only 2D descriptors, and demonstrate that well-curated, descriptor-based ensemble models remain competitive with state-of-the-art graph neural network architectures.",
        "authors": "Malikussaid, Septian Caesar Floresko, Ade Romadhony, Isman Kurniawan, Warih Maharani, Hilal Hudan Nuha",
        "url": "http://arxiv.org/abs/2512.24643v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24643v1",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文提出了一个可扩展的logP预测框架，并进行了深入的统计分析。它讨论了异方差性问题，并评估了加权最小二乘法和Box-Cox变换等经典统计补救措施。通过SHAP分析解释模型，并比较了不同模型（线性模型、树模型、GNNs）。虽然主要应用现有统计方法，但其对统计问题的严谨处理和解释性分析，使其在应用统计学方面具有很高的严谨性。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24614v1",
        "title": "Chat-Driven Optimal Management for Virtual Network Services",
        "summary": "This paper proposes a chat-driven network management framework that integrates natural language processing (NLP) with optimization-based virtual network allocation, enabling intuitive and reliable reconfiguration of virtual network services. Conventional intent-based networking (IBN) methods depend on statistical language models to interpret user intent but cannot guarantee the feasibility of generated configurations. To overcome this, we develop a two-stage framework consisting of an Interpreter, which extracts intent from natural language prompts using NLP, and an Optimizer, which computes feasible virtual machine (VM) placement and routing via an integer linear programming. In particular, the Interpreter translates user chats into update directions, i.e., whether to increase, decrease, or maintain parameters such as CPU demand and latency bounds, thereby enabling iterative refinement of the network configuration. In this paper, two intent extractors, which are a Sentence-BERT model with support vector machine (SVM) classifiers and a large language model (LLM), are introduced. Experiments in single-user and multi-user settings show that the framework dynamically updates VM placement and routing while preserving feasibility. The LLM-based extractor achieves higher accuracy with fewer labeled samples, whereas the Sentence-BERT with SVM classifiers provides significantly lower latency suitable for real-time operation. These results underscore the effectiveness of combining NLP-driven intent extraction with optimization-based allocation for safe, interpretable, and user-friendly virtual network management.",
        "authors": "Yuya Miyaoka, Masaki Inoue, Kengo Urata, Shigeaki Harada",
        "url": "http://arxiv.org/abs/2512.24614v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24614v1",
        "scores": {
            "Novelty": 3,
            "Rigor": 4,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了一个聊天驱动的网络管理框架，将自然语言处理与基于优化的虚拟网络分配相结合，其中优化器通过整数线性规划（ILP）确保配置的可行性。ILP是一种高度严谨的数学优化方法，其核心在于保证解决方案的数学可行性。这体现了将严谨的数学优化逻辑应用于现代AI系统（网络管理）的思路，符合您的偏好。"
    },
    {
        "id": "http://arxiv.org/abs/2512.25060v1",
        "title": "On the geometry and topology of representations: the manifolds of modular addition",
        "summary": "The Clock and Pizza interpretations, associated with architectures differing in either uniform or learnable attention, were introduced to argue that different architectural designs can yield distinct circuits for modular addition. In this work, we show that this is not the case, and that both uniform attention and trainable attention architectures implement the same algorithm via topologically and geometrically equivalent representations. Our methodology goes beyond the interpretation of individual neurons and weights. Instead, we identify all of the neurons corresponding to each learned representation and then study the collective group of neurons as one entity. This method reveals that each learned representation is a manifold that we can study utilizing tools from topology. Based on this insight, we can statistically analyze the learned representations across hundreds of circuits to demonstrate the similarity between learned modular addition circuits that arise naturally from common deep learning paradigms.",
        "authors": "Gabriela Moisescu-Pareja, Gavin McCracken, Harley Wiltzer, Vincent Létourneau, Colin Daniels, Doina Precup, Jonathan Love",
        "url": "http://arxiv.org/abs/2512.25060v1",
        "pdf_url": "https://arxiv.org/pdf/2512.25060v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Impact": 3,
            "Clarity": 3
        },
        "reason_zh": "这篇论文通过拓扑学和几何学的工具来研究神经网络中学习到的表示，特别是模块化加法电路的流形结构。它超越了对单个神经元的解释，而是将神经元集合作为一个实体进行拓扑和几何分析。这种对AI系统内部表示进行深度数学分析的方法，直接符合您对“严谨的数学逻辑”和“强大的理论基础”（如几何学、拓扑学）的偏好。"
    },
    {
        "id": "http://arxiv.org/abs/2512.25056v1",
        "title": "Sequential Bayesian parameter-state estimation in dynamical systems with noisy and incomplete observations via a variational framework",
        "summary": "Online joint estimation of unknown parameters and states in a dynamical system with uncertainty quantification is crucial in many applications. For example, digital twins dynamically update their knowledge of model parameters and states to support prediction and decision-making. Reliability and computational speed are vital for DTs. Online parameter-state estimation ensures computational efficiency, while uncertainty quantification is essential for making reliable predictions and decisions. In parameter-state estimation, the joint distribution of the state and model parameters conditioned on the data, termed the joint posterior, provides accurate uncertainty quantification. Because the joint posterior is generally intractable to compute, this paper presents an online variational inference framework to compute its approximation at each time step. The approximation is factorized into a marginal distribution over the model parameters and a state distribution conditioned on the parameters. This factorization enables recursive updates through a two-stage procedure: first, the parameter posterior is approximated via variational inference; second, the state distribution conditioned on the parameters is computed using Gaussian filtering based on the estimated parameter posterior. The algorithmic design is supported by a theorem establishing upper bounds on the joint posterior approximation error. Numerical experiments demonstrate that the proposed method (i) matches the performance of the joint particle filter in low-dimensional problems, accurately inferring both unobserved states and unknown parameters of dynamical and observation models; (ii) remains robust under noisy, partial observations and model discrepancies in a chaotic Lorenz 96 system; and (iii) scales effectively to a high-dimensional convection-diffusion system, where it outperforms the joint ensemble Kalman filter.",
        "authors": "Liliang Wang, Alex Gorodetsky",
        "url": "http://arxiv.org/abs/2512.25056v1",
        "pdf_url": "https://arxiv.org/pdf/2512.25056v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了一个在线变分推断框架，用于动态系统中参数和状态的序贯贝叶斯估计，并提供了不确定性量化。最重要的是，它通过“一个定理建立了联合后验近似误差的上限”。这直接满足了您对“统计保证”、“优化收敛性”和“清晰的数学推导”的极高要求，是统计学博士生非常值得深入研究的论文。"
    },
    {
        "id": "http://arxiv.org/abs/2512.25032v1",
        "title": "Testing Monotonicity in a Finite Population",
        "summary": "We consider the extent to which we can learn from a completely randomized experiment whether everyone has treatment effects that are weakly of the same sign, a condition we call monotonicity. From a classical sampling perspective, it is well-known that monotonicity is untestable. By contrast, we show from the design-based perspective -- in which the units in the population are fixed and only treatment assignment is stochastic -- that the distribution of treatment effects in the finite population (and hence whether monotonicity holds) is formally identified. We argue, however, that the usual definition of identification is unnatural in the design-based setting because it imagines knowing the distribution of outcomes over different treatment assignments for the same units. We thus evaluate the informativeness of the data by the extent to which it enables frequentist testing and Bayesian updating. We show that frequentist tests can have nontrivial power against some alternatives, but power is generically limited. Likewise, we show that there exist (non-degenerate) Bayesian priors that never update about whether monotonicity holds. We conclude that, despite the formal identification result, the ability to learn about monotonicity from data in practice is severely limited.",
        "authors": "Jiafeng Chen, Jonathan Roth, Jann Spiess",
        "url": "http://arxiv.org/abs/2512.25032v1",
        "pdf_url": "https://arxiv.org/pdf/2512.25032v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 3,
            "Clarity": 4
        },
        "reason_zh": "这篇论文从设计视角探讨了有限总体中单调性（treatment effects同号）的可检验性。它讨论了识别性、频率论检验和贝叶斯更新的局限性。论文深入探讨了因果推断中的基本理论问题，明确提及“形式识别”、“频率论检验”和“贝叶斯更新”，具有极高的统计学和因果逻辑严谨性，是您会非常感兴趣的理论性工作。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24842v1",
        "title": "Triangulation as an Acceptance Rule for Multilingual Mechanistic Interpretability",
        "summary": "Multilingual language models achieve strong aggregate performance yet often behave unpredictably across languages, scripts, and cultures. We argue that mechanistic explanations for such models should satisfy a \\emph{causal} standard: claims must survive causal interventions and must \\emph{cross-reference} across environments that perturb surface form while preserving meaning. We formalize \\emph{reference families} as predicate-preserving variants and introduce \\emph{triangulation}, an acceptance rule requiring necessity (ablating the circuit degrades the target behavior), sufficiency (patching activations transfers the behavior), and invariance (both effects remain directionally stable and of sufficient magnitude across the reference family). To supply candidate subgraphs, we adopt automatic circuit discovery and \\emph{accept or reject} those candidates by triangulation. We ground triangulation in causal abstraction by casting it as an approximate transformation score over a distribution of interchange interventions, connect it to the pragmatic interpretability agenda, and present a comparative experimental protocol across multiple model families, language pairs, and tasks. Triangulation provides a falsifiable standard for mechanistic claims that filters spurious circuits passing single-environment tests but failing cross-lingual invariance.",
        "authors": "Yanan Long",
        "url": "http://arxiv.org/abs/2512.24842v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24842v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文为多语言机制可解释性引入了一个“因果标准”和“三角测量”接受规则，并将其根植于“因果抽象”和“近似变换分数”。它通过因果干预和跨环境交叉引用来验证机制解释。这种将因果逻辑和严谨的数学框架应用于AI系统可解释性的方法，具有强大的理论基础和清晰的逻辑推导，与您的研究偏好高度契合。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24694v1",
        "title": "Mobility-Assisted Decentralized Federated Learning: Convergence Analysis and A Data-Driven Approach",
        "summary": "Decentralized Federated Learning (DFL) has emerged as a privacy-preserving machine learning paradigm that enables collaborative training among users without relying on a central server. However, its performance often degrades significantly due to limited connectivity and data heterogeneity. As we move toward the next generation of wireless networks, mobility is increasingly embedded in many real-world applications. The user mobility, either natural or induced, enables clients to act as relays or bridges, thus enhancing information flow in sparse networks; however, its impact on DFL has been largely overlooked despite its potential. In this work, we systematically investigate the role of mobility in improving DFL performance. We first establish the convergence of DFL in sparse networks under user mobility and theoretically demonstrate that even random movement of a fraction of users can significantly boost performance. Building upon this insight, we propose a DFL framework that utilizes mobile users with induced mobility patterns, allowing them to exploit the knowledge of data distribution to determine their trajectories to enhance information propagation through the network. Through extensive experiments, we empirically confirm our theoretical findings, validate the superiority of our approach over baselines, and provide a comprehensive analysis of how various network parameters influence DFL performance in mobile networks.",
        "authors": "Reza Jahani, Md Farhamdur Reza, Richeng Jin, Huaiyu Dai",
        "url": "http://arxiv.org/abs/2512.24694v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24694v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "这篇论文系统地研究了移动性在去中心化联邦学习（DFL）中的作用，并“首次建立了用户移动下稀疏网络中DFL的收敛性”。它理论上证明了即使是部分用户的随机移动也能显著提升性能。对“优化收敛性”的明确理论分析和证明，使其在理论严谨性方面得分极高，是您作为统计学博士生非常值得深入研究的论文。"
    },
    {
        "id": "http://arxiv.org/abs/2512.24564v1",
        "title": "CPR: Causal Physiological Representation Learning for Robust ECG Analysis under Distribution Shifts",
        "summary": "Deep learning models for Electrocardiogram (ECG) diagnosis have achieved remarkable accuracy but exhibit fragility against adversarial perturbations, particularly Smooth Adversarial Perturbations (SAP) that mimic biological morphology. Existing defenses face a critical dilemma: Adversarial Training (AT) provides robustness but incurs a prohibitive computational burden, while certified methods like Randomized Smoothing (RS) introduce significant inference latency, rendering them impractical for real-time clinical monitoring. We posit that this vulnerability stems from the models' reliance on non-robust spurious correlations rather than invariant pathological features. To address this, we propose Causal Physiological Representation Learning (CPR). Unlike standard denoising approaches that operate without semantic constraints, CPR incorporates a Physiological Structural Prior within a causal disentanglement framework. By modeling ECG generation via a Structural Causal Model (SCM), CPR enforces a structural intervention that strictly separates invariant pathological morphology (P-QRS-T complex) from non-causal artifacts. Empirical results on PTB-XL demonstrate that CPR significantly outperforms standard clinical preprocessing methods. Specifically, under SAP attacks, CPR achieves an F1 score of 0.632, surpassing Median Smoothing (0.541 F1) by 9.1%. Crucially, CPR matches the certified robustness of Randomized Smoothing while maintaining single-pass inference efficiency, offering a superior trade-off between robustness, efficiency, and clinical interpretability.",
        "authors": "Shunbo Jia, Caizhi Liao",
        "url": "http://arxiv.org/abs/2512.24564v1",
        "pdf_url": "https://arxiv.org/pdf/2512.24564v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "CPR论文通过“因果解耦框架”和“结构因果模型（SCM）”来学习鲁棒的生理表示，以应对ECG分析中的分布偏移。它强制进行“结构干预”，将不变的病理形态与非因果伪影分离。这种基于SCM的因果逻辑和因果解耦方法，提供了强大的理论基础和严谨的数学推导，直接符合您对“因果逻辑”和“理论严谨性”的偏好，且具有重要的临床实践意义。"
    }
]