[
    {
        "id": "http://arxiv.org/abs/2512.08847v1",
        "title": "Partially Bayes p-values for large scale inference",
        "summary": "We seek to conduct statistical inference for a large collection of primary parameters, each with its own nuisance parameters. Our approach is partially Bayesian, in that we treat the primary parameters as fixed while we model the nuisance parameters as random and drawn from an unknown distribution which we endow with a nonparametric prior. We compute partially Bayes p-values by conditioning on nuisance parameter statistics, that is, statistics that are ancillary for the primary parameters and informative about the nuisance parameters. The proposed p-values have a Bayesian interpretation as tail areas computed with respect to the posterior distribution of the nuisance parameters. Similarly to the conditional predictive p-values of Bayarri and Berger, the partially Bayes p-values avoid double use of the data (unlike posterior predictive p-values). A key ingredient of our approach is that we model nuisance parameters hierarchically across problems; the sharing of information across problems leads to improved calibration. We illustrate the proposed partially Bayes p-values in two applications: the normal means problem with unknown variances and a location-scale model with unknown distribution shape. We model the scales via Dirichlet processes in both examples and the distribution shape via Pólya trees in the second. Our proposed partially Bayes p-values increase power and calibration compared to purely frequentist alternatives.",
        "authors": "Nikolaos Ignatiadis, Li Ma",
        "url": "http://arxiv.org/abs/2512.08847v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08847v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了DAO-GP，一个针对概念漂移的在线高斯过程模型。其“完全自适应、无超参数、衰减和稀疏”的特性，以及内置的漂移检测和适应机制，表明了深厚的数学建模和理论推导，尤其在高斯过程的在线适应性方面具有严谨性。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08828v1",
        "title": "Prediction Intervals for Individual Treatment Effects in a Multiple Decision Point Framework using Conformal Inference",
        "summary": "Accurately quantifying uncertainty of individual treatment effects (ITEs) across multiple decision points is crucial for personalized decision-making in fields such as healthcare, finance, education, and online marketplaces. Previous work has focused on predicting non-causal longitudinal estimands or constructing prediction bands for ITEs using cross-sectional data based on exchangeability assumptions. We propose a novel method for constructing prediction intervals using conformal inference techniques for time-varying ITEs with weaker assumptions than prior literature. We guarantee a lower bound for coverage, which is dependent on the degree of non-exchangeability in the data. Although our method is broadly applicable across decision-making contexts, we support our theoretical claims with simulations emulating micro-randomized trials (MRTs) -- a sequential experimental design for mobile health (mHealth) studies. We demonstrate the practical utility of our method by applying it to a real-world MRT - the Intern Health Study (IHS).",
        "authors": "Swaraj Bose, Walter Dempsey",
        "url": "http://arxiv.org/abs/2512.08828v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08828v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了一种利用共形推断为多决策点框架下的个体治疗效果（ITE）构建预测区间的新方法。共形推断以其有限样本覆盖率保证而闻名，论文明确指出其方法在较弱假设下能保证覆盖率的下界，这体现了强大的统计学理论基础和明确的理论保证，与您的偏好高度契合。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08847v1",
        "title": "Partially Bayes p-values for large scale inference",
        "summary": "We seek to conduct statistical inference for a large collection of primary parameters, each with its own nuisance parameters. Our approach is partially Bayesian, in that we treat the primary parameters as fixed while we model the nuisance parameters as random and drawn from an unknown distribution which we endow with a nonparametric prior. We compute partially Bayes p-values by conditioning on nuisance parameter statistics, that is, statistics that are ancillary for the primary parameters and informative about the nuisance parameters. The proposed p-values have a Bayesian interpretation as tail areas computed with respect to the posterior distribution of the nuisance parameters. Similarly to the conditional predictive p-values of Bayarri and Berger, the partially Bayes p-values avoid double use of the data (unlike posterior predictive p-values). A key ingredient of our approach is that we model nuisance parameters hierarchically across problems; the sharing of information across problems leads to improved calibration. We illustrate the proposed partially Bayes p-values in two applications: the normal means problem with unknown variances and a location-scale model with unknown distribution shape. We model the scales via Dirichlet processes in both examples and the distribution shape via Pólya trees in the second. Our proposed partially Bayes p-values increase power and calibration compared to purely frequentist alternatives.",
        "authors": "Nikolaos Ignatiadis, Li Ma",
        "url": "http://arxiv.org/abs/2512.08847v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08847v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 4,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了DAO-GP，一个针对概念漂移的在线高斯过程模型。其“完全自适应、无超参数、衰减和稀疏”的特性，以及内置的漂移检测和适应机制，表明了深厚的数学建模和理论推导，尤其在高斯过程的在线适应性方面具有严谨性。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08828v1",
        "title": "Prediction Intervals for Individual Treatment Effects in a Multiple Decision Point Framework using Conformal Inference",
        "summary": "Accurately quantifying uncertainty of individual treatment effects (ITEs) across multiple decision points is crucial for personalized decision-making in fields such as healthcare, finance, education, and online marketplaces. Previous work has focused on predicting non-causal longitudinal estimands or constructing prediction bands for ITEs using cross-sectional data based on exchangeability assumptions. We propose a novel method for constructing prediction intervals using conformal inference techniques for time-varying ITEs with weaker assumptions than prior literature. We guarantee a lower bound for coverage, which is dependent on the degree of non-exchangeability in the data. Although our method is broadly applicable across decision-making contexts, we support our theoretical claims with simulations emulating micro-randomized trials (MRTs) -- a sequential experimental design for mobile health (mHealth) studies. We demonstrate the practical utility of our method by applying it to a real-world MRT - the Intern Health Study (IHS).",
        "authors": "Swaraj Bose, Walter Dempsey",
        "url": "http://arxiv.org/abs/2512.08828v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08828v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了一种利用共形推断为多决策点框架下的个体治疗效果（ITE）构建预测区间的新方法。共形推断以其有限样本覆盖率保证而闻名，论文明确指出其方法在较弱假设下能保证覆盖率的下界，这体现了强大的统计学理论基础和明确的理论保证，与您的偏好高度契合。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08735v1",
        "title": "Stationary Point Constrained Inference via Diffeomorphisms",
        "summary": "Stationary points or derivative zero crossings of a regression function correspond to points where a trend reverses, making their estimation scientifically important. Existing approaches to uncertainty quantification for stationary points cannot deliver valid joint inference when multiple extrema are present, an essential capability in applications where the relative locations of peaks and troughs carry scientific significance. We develop a principled framework for functions with multiple regions of monotonicity by constraining the number of stationary points. We represent each function in the diffeomorphic formulation as the composition of a simple template and a smooth bijective transformation, and show that this parameterization enables coherent joint inference on the extrema. This construction guarantees a prespecified number of stationary points and provides a direct, interpretable parameterization of their locations. We derive non-asymptotic confidence bounds and establish approximate normality for the maximum likelihood estimators, with parallel results in the Bayesian setting. Simulations and an application to brain signal estimation demonstrate the method's accuracy and interpretability.",
        "authors": "Michael Price, Debdeep Pati, Ning Ning",
        "url": "http://arxiv.org/abs/2512.08735v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08735v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 3,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了一个通过微分同胚（diffeomorphisms）约束驻点数量的函数推断框架，实现了对多个极值点的联合推断。该方法推导了非渐近置信区间并建立了最大似然估计量的渐近正态性，理论严谨性极高，数学推导清晰，是您会感兴趣的纯理论统计学工作。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08671v1",
        "title": "DS FedProxGrad: Asymptotic Stationarity Without Noise Floor in Fair Federated Learning",
        "summary": "Recent work \\cite{arifgroup} introduced Federated Proximal Gradient \\textbf{(\\texttt{FedProxGrad})} for solving non-convex composite optimization problems in group fair federated learning. However, the original analysis established convergence only to a \\textit{noise-dominated neighborhood of stationarity}, with explicit dependence on a variance-induced noise floor. In this work, we provide an improved asymptotic convergence analysis for a generalized \\texttt{FedProxGrad}-type analytical framework with inexact local proximal solutions and explicit fairness regularization. We call this extended analytical framework \\textbf{DS \\texttt{FedProxGrad}} (Decay Step Size \\texttt{FedProxGrad}). Under a Robbins-Monro step-size schedule \\cite{robbins1951stochastic} and a mild decay condition on local inexactness, we prove that $\\liminf_{r\\to\\infty} \\mathbb{E}[\\|\\nabla F(\\mathbf{x}^r)\\|^2] = 0$, i.e., the algorithm is asymptotically stationary and the convergence rate does not depend on a variance-induced noise floor.",
        "authors": "Huzaifa Arif",
        "url": "http://arxiv.org/abs/2512.08671v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08671v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文对公平联邦学习中的FedProxGrad算法进行了改进的渐近收敛性分析。在Robbins-Monro步长调度和温和衰减条件下，证明了算法的渐近平稳性，且收敛速率不依赖于方差引起的噪声下限。这展示了强大的优化理论基础和严谨的数学推导，直接符合您对优化收敛性的要求。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08592v1",
        "title": "The SMART+ Framework for AI Systems",
        "summary": "Artificial Intelligence (AI) systems are now an integral part of multiple industries. In clinical research, AI supports automated adverse event detection in clinical trials, patient eligibility screening for protocol enrollment, and data quality validation. Beyond healthcare, AI is transforming finance through real-time fraud detection, automated loan risk assessment, and algorithmic decision-making. Similarly, in manufacturing, AI enables predictive maintenance to reduce equipment downtime, enhances quality control through computer-vision inspection, and optimizes production workflows using real-time operational data. While these technologies enhance operational efficiency, they introduce new challenges regarding safety, accountability, and regulatory compliance. To address these concerns, we introduce the SMART+ Framework - a structured model built on the pillars of Safety, Monitoring, Accountability, Reliability, and Transparency, and further enhanced with Privacy & Security, Data Governance, Fairness & Bias, and Guardrails. SMART+ offers a practical, comprehensive approach to evaluating and governing AI systems across industries. This framework aligns with evolving mechanisms and regulatory guidance to integrate operational safeguards, oversight procedures, and strengthened privacy and governance controls. SMART+ demonstrates risk mitigation, trust-building, and compliance readiness. By enabling responsible AI adoption and ensuring auditability, SMART+ provides a robust foundation for effective AI governance in clinical research.",
        "authors": "Laxmiraju Kandikatla, Branislav Radeljic",
        "url": "http://arxiv.org/abs/2512.08592v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08592v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "IDAIF框架将变革理论与AI系统设计相结合，其每个层次都融入了严谨的理论基础，如多目标帕累托优化、因果有向无环图（DAGs）用于幻觉缓解，以及强化学习用于公平性保证。论文明确提供了每个组件的正式数学公式，这在框架层面提供了极高的理论严谨性。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08508v1",
        "title": "Fused Gromov-Wasserstein Contrastive Learning for Effective Enzyme-Reaction Screening",
        "summary": "Enzymes are crucial catalysts that enable a wide range of biochemical reactions. Efficiently identifying specific enzymes from vast protein libraries is essential for advancing biocatalysis. Traditional computational methods for enzyme screening and retrieval are time-consuming and resource-intensive. Recently, deep learning approaches have shown promise. However, these methods focus solely on the interaction between enzymes and reactions, overlooking the inherent hierarchical relationships within each domain. To address these limitations, we introduce FGW-CLIP, a novel contrastive learning framework based on optimizing the fused Gromov-Wasserstein distance. FGW-CLIP incorporates multiple alignments, including inter-domain alignment between reactions and enzymes and intra-domain alignment within enzymes and reactions. By introducing a tailored regularization term, our method minimizes the Gromov-Wasserstein distance between enzyme and reaction spaces, which enhances information integration across these domains. Extensive evaluations demonstrate the superiority of FGW-CLIP in challenging enzyme-reaction tasks. On the widely-used EnzymeMap benchmark, FGW-CLIP achieves state-of-the-art performance in enzyme virtual screening, as measured by BEDROC and EF metrics. Moreover, FGW-CLIP consistently outperforms across all three splits of ReactZyme, the largest enzyme-reaction benchmark, demonstrating robust generalization to novel enzymes and reactions. These results position FGW-CLIP as a promising framework for enzyme discovery in complex biochemical settings, with strong adaptability across diverse screening scenarios.",
        "authors": "Gengmo Zhou, Feng Yu, Wenda Wang, Zhifeng Gao, Guolin Ke, Zhewei Wei, Zhen Wang",
        "url": "http://arxiv.org/abs/2512.08508v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08508v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文引入了FGW-CLIP，一个基于优化融合Gromov-Wasserstein距离的新型对比学习框架。通过量身定制的正则化项，最小化酶和反应空间之间的Gromov-Wasserstein距离，具有强大的最优传输理论和度量几何基础，数学严谨性极高。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08499v1",
        "title": "Developing Distance-Aware Uncertainty Quantification Methods in Physics-Guided Neural Networks for Reliable Bearing Health Prediction",
        "summary": "Accurate and uncertainty-aware degradation estimation is essential for predictive maintenance in safety-critical systems like rotating machinery with rolling-element bearings. Many existing uncertainty methods lack confidence calibration, are costly to run, are not distance-aware, and fail to generalize under out-of-distribution data. We introduce two distance-aware uncertainty methods for deterministic physics-guided neural networks: PG-SNGP, based on Spectral Normalization Gaussian Process, and PG-SNER, based on Deep Evidential Regression. We apply spectral normalization to the hidden layers so the network preserves distances from input to latent space. PG-SNGP replaces the final dense layer with a Gaussian Process layer for distance-sensitive uncertainty, while PG-SNER outputs Normal Inverse Gamma parameters to model uncertainty in a coherent probabilistic form. We assess performance using standard accuracy metrics and a new distance-aware metric based on the Pearson Correlation Coefficient, which measures how well predicted uncertainty tracks the distance between test and training samples. We also design a dynamic weighting scheme in the loss to balance data fidelity and physical consistency. We test our methods on rolling-element bearing degradation using the PRONOSTIA dataset and compare them with Monte Carlo and Deep Ensemble PGNNs. Results show that PG-SNGP and PG-SNER improve prediction accuracy, generalize reliably under OOD conditions, and remain robust to adversarial attacks and noise.",
        "authors": "Waleed Razzaq, Yun-Bo Zhao",
        "url": "http://arxiv.org/abs/2512.08499v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08499v1",
        "scores": {
            "Novelty": 4,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了两种针对物理引导神经网络的距离感知不确定性量化方法（PG-SNGP和PG-SNER），利用谱归一化高斯过程和深度证据回归，并结合了物理约束。这展示了在不确定性量化、高斯过程和证据学习方面的严谨统计和数学建模。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08252v1",
        "title": "Causal inference under interference: computational barriers and algorithmic solutions",
        "summary": "We study causal effect estimation under interference from network data. We work under the chain-graph formulation pioneered in Tchetgen Tchetgen et. al (2021). Our first result shows that polynomial time evaluation of treatment effects is computationally hard in this framework without additional assumptions on the underlying chain graph. Subsequently, we assume that the interactions among the study units are governed either by (i) a dense graph or (ii) an i.i.d. Gaussian matrix. In each case, we show that the treatment effects have well-defined limits as the population size diverges to infinity. Additionally, we develop polynomial time algorithms to consistently evaluate the treatment effects in each case. Finally, we estimate the unknown parameters from the observed data using maximum pseudo-likelihood estimates, and establish the stability of our causal effect estimators under this perturbation. Our algorithms provably approximate the causal effects in polynomial time even in low-temperature regimes where the canonical MCMC samplers are slow mixing. For dense graphs, our results use the notion of regularity partitions; for Gaussian interactions, our approach uses ideas from spin glass theory and Approximate Message Passing.",
        "authors": "Sohom Bhattacharya, Subhabrata Sen",
        "url": "http://arxiv.org/abs/2512.08252v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08252v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文深入研究了网络数据下因果效应估计的计算障碍和算法解决方案，利用链图公式、正则化划分、自旋玻璃理论和近似消息传递等高级数学工具。它提供了严谨的计算复杂性分析和算法保证，是因果推断领域理论研究的典范。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08241v1",
        "title": "Persistent Topological Structures and Cohomological Flows as a Mathematical Framework for Brain-Inspired Representation Learning",
        "summary": "This paper presents a mathematically rigorous framework for brain-inspired representation learning founded on the interplay between persistent topological structures and cohomological flows. Neural computation is reformulated as the evolution of cochain maps over dynamic simplicial complexes, enabling representations that capture invariants across temporal, spatial, and functional brain states. The proposed architecture integrates algebraic topology with differential geometry to construct cohomological operators that generalize gradient-based learning within a homological landscape. Synthetic data with controlled topological signatures and real neural datasets are jointly analyzed using persistent homology, sheaf cohomology, and spectral Laplacians to quantify stability, continuity, and structural preservation. Empirical results demonstrate that the model achieves superior manifold consistency and noise resilience compared to graph neural and manifold-based deep architectures, establishing a coherent mathematical foundation for topology-driven representation learning.",
        "authors": "Preksha Girish, Rachana Mysore, Mahanthesha U, Shrey Kumar, Shipra Prashant",
        "url": "http://arxiv.org/abs/2512.08241v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08241v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了一个基于持久拓扑结构和上同调流的脑启发式表示学习的数学严谨框架。它整合了代数拓扑、微分几何、持久同调和谱拉普拉斯算子，为表示学习提供了深刻的数学基础，是理论与AI结合的优秀范例。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08218v1",
        "title": "PR-CapsNet: Pseudo-Riemannian Capsule Network with Adaptive Curvature Routing for Graph Learning",
        "summary": "Capsule Networks (CapsNets) show exceptional graph representation capacity via dynamic routing and vectorized hierarchical representations, but they model the complex geometries of real\\-world graphs poorly by fixed\\-curvature space due to the inherent geodesical disconnectedness issues, leading to suboptimal performance. Recent works find that non\\-Euclidean pseudo\\-Riemannian manifolds provide specific inductive biases for embedding graph data, but how to leverage them to improve CapsNets is still underexplored. Here, we extend the Euclidean capsule routing into geodesically disconnected pseudo\\-Riemannian manifolds and derive a Pseudo\\-Riemannian Capsule Network (PR\\-CapsNet), which models data in pseudo\\-Riemannian manifolds of adaptive curvature, for graph representation learning. Specifically, PR\\-CapsNet enhances the CapsNet with Adaptive Pseudo\\-Riemannian Tangent Space Routing by utilizing pseudo\\-Riemannian geometry. Unlike single\\-curvature or subspace\\-partitioning methods, PR\\-CapsNet concurrently models hierarchical and cluster or cyclic graph structures via its versatile pseudo\\-Riemannian metric. It first deploys Pseudo\\-Riemannian Tangent Space Routing to decompose capsule states into spherical\\-temporal and Euclidean\\-spatial subspaces with diffeomorphic transformations. Then, an Adaptive Curvature Routing is developed to adaptively fuse features from different curvature spaces for complex graphs via a learnable curvature tensor with geometric attention from local manifold properties. Finally, a geometric properties\\-preserved Pseudo\\-Riemannian Capsule Classifier is developed to project capsule embeddings to tangent spaces and use curvature\\-weighted softmax for classification. Extensive experiments on node and graph classification benchmarks show PR\\-CapsNet outperforms SOTA models, validating PR\\-CapsNet's strong representation power for complex graph structures.",
        "authors": "Ye Qin, Jingchao Wang, Yang Shi, Haiying Huang, Junxu Li, Weijian Liu, Tinghui Chen, Jinghui Qin",
        "url": "http://arxiv.org/abs/2512.08218v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08218v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文将欧几里得胶囊路由扩展到伪黎曼流形，提出了PR-CapsNet。该模型在自适应曲率的伪黎曼流形中建模数据，利用微分几何和流形学习的深层数学原理，为图学习提供了强大的理论支持和严谨的数学推导。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08146v1",
        "title": "Uncertainty quantification for mixed membership in multilayer networks with degree heterogeneity using Gaussian variational inference",
        "summary": "Analyzing multilayer networks is central to understanding complex relational measurements collected across multiple conditions or over time. A pivotal task in this setting is to quantify uncertainty in community structure while appropriately pooling information across layers and accommodating layer-specific heterogeneity. Building on the multilayer degree-corrected mixed-membership (ML-DCMM) model, which captures both stable community membership profiles and layer-specific vertex activity levels, we propose a Bayesian inference framework based on a spectral-assisted likelihood. We then develop a computationally efficient Gaussian variational inference algorithm implemented via stochastic gradient descent. Our theoretical analysis establishes a variational Bernstein--von Mises theorem, which provides a frequentist guarantee for using the variational posterior to construct confidence sets for mixed memberships. We demonstrate the utility of the method on a U.S. airport longitudinal network, where the procedure yields robust estimates, natural uncertainty quantification, and competitive performance relative to state-of-the-art methods.",
        "authors": "Fangzheng Xie, Hsin-Hsiung Huang",
        "url": "http://arxiv.org/abs/2512.08146v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08146v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了一个贝叶斯推断框架，用于多层网络中混合成员的不确定性量化，并发展了高斯变分推断算法。最重要的是，它建立了变分Bernstein--von Mises定理，为使用变分后验构建置信区间提供了频率学保证，理论严谨性极高，是统计保证的典范。"
    },
    {
        "id": "http://arxiv.org/abs/2512.08140v1",
        "title": "Non-parametric assessment of the calibration of individualized treatment effects",
        "summary": "An important aspect of the performance of algorithms that predict individualized treatment effects (ITE) is moderate calibration, i.e., the average treatment effect among individuals with predicted treatment effect of z being equal to z. The assessment of moderate calibration is a challenging task on two fronts: counterfactual responses are unobserved, and quantifying the conditional response function for models that generate continuous predicted values requires regularization or parametric modeling. Perhaps because of these challenges, there is currently no inferential method for the null hypothesis that an ITE model is moderately calibrated in a population. In this work, we propose non-parametric methods for the assessment of moderate calibration of ITE models for binary outcomes using data from a randomized trial. These methods simultaneously resolve both challenges, resulting in novel numerical, graphical, and inferential methods for the assessment of moderate calibration. The key idea is to formulate a stochastic process for the cumulative prediction errors that obeys a functional central limit theorem, enabling the use of the properties of Brownian motion for asymptotic inference. We propose two approaches to construct this process from a sample: a conditional approach that relies on predicted risks (often an output of ITE models), and a marginal approach based on replacing the cumulative conditional expected value and variance terms with their marginal counterparts. Numerical simulations confirm the desirable properties of both approaches and their ability to detect miscalibration of different forms. We use a case study to provide practical suggestions on graphical presentation and the interpretation of results. Moderate calibration of predicted ITEs can be assessed without requiring regularization techniques or making assumptions about the functional form of treatment response.",
        "authors": "Mohsen Sadatsafavi, Jeroen Hoogland, Thomas P. A. Debray, John Petkau",
        "url": "http://arxiv.org/abs/2512.08140v1",
        "pdf_url": "https://arxiv.org/pdf/2512.08140v1",
        "scores": {
            "Novelty": 5,
            "Rigor": 5,
            "Impact": 4,
            "Clarity": 4
        },
        "reason_zh": "该论文提出了评估个体治疗效果（ITE）校准的非参数方法，构建了一个遵循泛函中心极限定理的随机过程，并利用布朗运动的性质进行渐近推断。这展示了深厚的统计学理论和非参数推断的严谨性，对于因果推断和个性化决策至关重要。"
    }
]