{
    "id": "http://arxiv.org/abs/2511.06692v1",
    "title": "Peeling Context from Cause for Multimodal Molecular Property Prediction",
    "summary": "Deep models are used for molecular property prediction, yet they are often difficult to interpret and may rely on spurious context rather than causal structure, which reduces reliability under distribution shift and harms predictive performance. We introduce CLaP (Causal Layerwise Peeling), a framework that separates causal signal from context in a layerwise manner and integrates diverse graph representations of molecules. At each layer, a causal block performs a soft split into causal and non-causal branches, fuses causal evidence across modalities, and progressively removes batch-coupled context to focus on label-relevant structure, thereby limiting shortcut signals and stabilizing layerwise refinement. Across four molecular benchmarks, CLaP consistently improves MAE, MSE, and $R^2$ over competitive baselines. The model also produces atom-level causal saliency maps that highlight substructures responsible for predictions, providing actionable guidance for targeted molecular edits. Case studies confirm the accuracy of these maps and their alignment with chemical intuition. By peeling context from cause at every layer, the model yields predictors that are both accurate and interpretable for molecular design.",
    "authors": "Tao Li, Kaiyuan Hou, Tuan Vinh, Carl Yang, Monika Raj",
    "url": "http://arxiv.org/abs/2511.06692v1",
    "pdf_url": "http://arxiv.org/pdf/2511.06692v1",
    "reason_zh": "这篇论文《Peeling Context from Cause for Multimodal Molecular Property Prediction》完美符合您的个人偏好和研究任务。您的研究兴趣是因果推断及其与深度学习的结合，并且您希望找到一篇关于因果推断在复杂AI模型中应用（如反事实分析、公平性、因果表示学习）的新方法论文。\n\n这篇论文的核心在于提出了一种名为 CLaP（Causal Layerwise Peeling）的新框架，旨在深度学习模型中**分离因果信号与背景噪声**，从而学习**因果表示**。这直接满足了您对“因果表示学习”的兴趣。论文明确指出，深度模型可能依赖虚假背景而非因果结构，这正是在复杂AI模型中整合因果推断的关键挑战。CLaP 框架通过在每一层进行“因果剥离”并融合多模态因果证据，构建了具有因果意识的深度模型。此外，模型还生成了“原子级因果显著图”，这不仅增强了模型的可解释性（XAI），也进一步体现了因果推断在理解模型决策中的应用。这完全符合您对因果推断与深度学习结合、应用于复杂AI模型、关注因果表示学习以及新方法论文的所有要求。",
    "reason_en": "This paper, \"Peeling Context from Cause for Multimodal Molecular Property Prediction,\" perfectly aligns with your personal preferences and research task. Your research interest is in causal inference and its integration with deep learning, and you are looking for a new method paper on the application of causal inference in complex AI models (e.g., counterfactual analysis, fairness, causal representation learning).\n\nThis paper's core contribution is the introduction of a new framework called CLaP (Causal Layerwise Peeling), which aims to **separate causal signals from spurious context** within deep learning models, thereby facilitating **causal representation learning**. This directly addresses your interest in \"causal representation learning.\" The paper explicitly states that deep models often rely on spurious context rather than causal structure, which is a key challenge in integrating causal inference into complex AI models. The CLaP framework builds causally aware deep models by performing \"causal peeling\" at each layer and fusing multimodal causal evidence. Furthermore, the model produces \"atom-level causal saliency maps,\" which not only enhance model interpretability (XAI) but also demonstrate the application of causal inference in understanding model decisions. This comprehensively meets all your requirements for a new method paper on causal inference combined with deep learning, applied in complex AI models, and focusing on causal representation learning."
}